coq/src/concordium_impls.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-06 Thu 12:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Concordium Smartcontract Infrastructure Implementations</title>
<meta name="author" content="Lasse Letager Hansen" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Concordium Smartcontract Infrastructure Implementations</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3559763">1. Concordium "Impls" specification</a>
<ul>
<li><a href="#orgcb2e017">1.1. Config</a></li>
<li><a href="#org24b869e">1.2. Imports</a></li>
<li><a href="#org240e46d">1.3. Rust code</a>
<ul>
<li><a href="#org28274e5">1.3.1. Reject</a></li>
<li><a href="#org88fe0ea">1.3.2. Contract state</a></li>
<li><a href="#orged9fe39">1.3.3. Parameter</a></li>
<li><a href="#orgd6c64f2">1.3.4. AttributesCursor</a></li>
</ul>
</li>
<li><a href="#orgbf4a7f1">1.4. Rust Tests</a></li>
<li><a href="#orgadc6d21">1.5. Resulting output</a></li>
<li><a href="#orgff24c33">1.6. Generation of backend output</a>
<ul>
<li><a href="#org38ab639">1.6.1. The includes</a></li>
<li><a href="#org427d530">1.6.2. Types and default implementations</a></li>
<li><a href="#orga7ee377">1.6.3. Error handling</a></li>
<li><a href="#org460e005">1.6.4. Contract state</a></li>
<li><a href="#org4a6120a">1.6.5. Parameter</a></li>
<li><a href="#orgbd414e3">1.6.6. Attributes Cursor</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3559763" class="outline-2">
<h2 id="org3559763"><span class="section-number-2">1.</span> Concordium "Impls" specification</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgcb2e017" class="outline-3">
<h3 id="orgcb2e017"><span class="section-number-3">1.1.</span> Config</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-toml">[<span style="color: #00ff00;">package</span>]
<span style="color: #9acd32;">name</span> = <span style="color: #bdb76b;">"concordium_impls"</span>
<span style="color: #9acd32;">version</span> = <span style="color: #bdb76b;">"0.1.0"</span>
<span style="color: #9acd32;">authors</span> = [<span style="color: #bdb76b;">""</span>]
<span style="color: #9acd32;">edition</span> = <span style="color: #bdb76b;">"2018"</span>

[<span style="color: #00ff00;">lib</span>]
<span style="color: #9acd32;">path</span> = <span style="color: #bdb76b;">"src/concordium_impls.rs"</span>

[<span style="color: #00ff00;">dependencies</span>]
<span style="color: #9acd32;">hacspec-lib</span> = { path = <span style="color: #bdb76b;">"../../lib"</span> }
<span style="color: #9acd32;">hacspec-attributes</span> = { path = <span style="color: #bdb76b;">"../../utils/attributes"</span>, version = <span style="color: #bdb76b;">"0.1.0-beta.1"</span> , features = [<span style="color: #bdb76b;">"print_attributes"</span>, <span style="color: #bdb76b;">"hacspec_unsafe"</span>] } <span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">, features = ["hacspec_unsafe"] , , optional = true</span>
<span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">pearlite-syn = { path = "../../../../creusot/pearlite-syn" }</span>
<span style="color: #9acd32;">creusot-contracts</span> = { path = <span style="color: #bdb76b;">"../../../../creusot/creusot-contracts"</span> }

[<span style="color: #00ff00;">features</span>]
<span style="color: #9acd32;">use_attributes</span> = [<span style="color: #bdb76b;">"hacspec-attributes/print_attributes"</span>, <span style="color: #bdb76b;">"hacspec-attributes/hacspec_unsafe"</span>]

[<span style="color: #00ff00;">dev-dependencies</span>]
<span style="color: #9acd32;">hacspec-dev</span> = { path = <span style="color: #bdb76b;">"../../utils/dev"</span> }
<span style="color: #9acd32;">criterion</span> = <span style="color: #bdb76b;">"0.3"</span>
<span style="color: #9acd32;">rand</span> = <span style="color: #bdb76b;">"0.8"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org24b869e" class="outline-3">
<h3 id="org24b869e"><span class="section-number-3">1.2.</span> Imports</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">not</span><span style="color: #cd8500;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"hacspec"</span><span style="color: #cd8500;">)</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">extern</span> <span style="color: #b3b3b3;">crate</span> hacspec_lib;

<span style="color: #b3b3b3;">use</span> <span style="color: #87ceeb;">hacspec_lib</span>::*;

<span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">#[cfg(feature = "hacspec_attributes")]</span>
<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"hacspec"</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">use</span> <span style="color: #87ceeb;">hacspec_attributes</span>::*;

<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">not</span><span style="color: #cd8500;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"hacspec"</span><span style="color: #cd8500;">)</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">extern</span> <span style="color: #b3b3b3;">crate</span> creusot_contracts;
<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">not</span><span style="color: #cd8500;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"hacspec"</span><span style="color: #cd8500;">)</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">use</span> <span style="color: #87ceeb;">creusot_contracts</span>::*;
</pre>
</div>
</div>
</div>

<div id="outline-container-org240e46d" class="outline-3">
<h3 id="org240e46d"><span class="section-number-3">1.3.</span> Rust code</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org28274e5" class="outline-4">
<h4 id="org28274e5"><span class="section-number-4">1.3.1.</span> Reject</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
We modle reject as the underlying data, that is the error code. The default constructor is i32 min.
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">type</span> <span style="color: #00ff00;">Reject</span> = <span style="color: #00ff00;">i32</span>;

<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, logic</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">reject_impl_deafult</span><span style="color: #7d26cd;">()</span> -&gt; <span style="color: #00ff00;">Reject</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #00ff00;">i32</span>::<span style="color: #00ff00;">MIN</span>
<span style="color: #7d26cd;">}</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">type</span> <span style="color: #00ff00;">OptionReject</span> = <span style="color: #00ff00;">Option</span><span style="color: #7d26cd;">&lt;</span><span style="color: #00ff00;">Reject</span><span style="color: #7d26cd;">&gt;</span>;

<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, logic</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">new_reject_impl</span><span style="color: #7d26cd;">(</span><span style="color: #9acd32;">x</span>: <span style="color: #00ff00;">i32</span><span style="color: #7d26cd;">)</span> -&gt; <span style="color: #00ff00;">OptionReject</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #b3b3b3;">if</span> x &lt; 0i32 <span style="color: #cd0000;">{</span>
        <span style="color: #00ff00;">OptionReject</span>::<span style="color: #00ff00;">Some</span><span style="color: #cd8500;">(</span>x<span style="color: #cd8500;">)</span>
    <span style="color: #cd0000;">}</span> <span style="color: #b3b3b3;">else</span> <span style="color: #cd0000;">{</span>
        <span style="color: #00ff00;">Option</span>::<span style="color: #cd8500;">&lt;</span><span style="color: #00ff00;">i32</span><span style="color: #cd8500;">&gt;</span>::<span style="color: #00ff00;">None</span> <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">OptionReject</span>
    <span style="color: #cd0000;">}</span>
<span style="color: #7d26cd;">}</span>

</pre>
</div>
</div>

<ol class="org-ol">
