coq/src/concordium_impls.org
**** Reject - From trait
#+begin_src rust :tangle no :eval never
  impl convert::From<()> for Reject {
      #[inline(always)]
      fn from(_: ()) -> Self {
	  Reject {
	      error_code: unsafe { num::NonZeroI32::new_unchecked(i32::MIN + 1) },
	  }
      }
  }

  impl convert::From<ParseError> for Reject {
      #[inline(always)]
      fn from(_: ParseError) -> Self {
	  Reject {
	      error_code: unsafe { num::NonZeroI32::new_unchecked(i32::MIN + 2) },
	  }
      }
  }
#+end_src

We modle the unsafe block with unchecked non zero as a precondition using requires giving us the hacspec equivalent
#+begin_src rust :tangle ../../examples/concordium_impls/src/concordium_impls.rs :eval never
  #[cfg_attr(feature = "creusot", logic)]
  #[ensures(result != 0i32)]
  pub fn reject_impl_convert_from_unit() -> Reject {
      i32::MIN + 1i32
  }

  #[cfg_attr(feature = "creusot", logic)]
  #[ensures(result != 0i32)]
  pub fn reject_impl_convert_from_parse_error() -> Reject {
      i32::MIN + 2i32
  }
#+end_src
which we can insert as the definition of the from functions in the trait implementation by using a coerce function
#+begin_src rust :tangle no :eval never
  pub fn coerce_hacspec_to_rust_reject(hacspec_reject: ConcordiumImpls::Reject) {
      Reject {
	  error_code: hacspec_reject,
      }
  }
#+end_src
We define a log error type and function converting from it to the reject type
#+begin_src rust :tangle ../../examples/concordium_impls/src/concordium_impls.rs :eval never
  /// Errors that can occur during logging.
  #[derive(Copy, Clone)] // , Debug, Eq, PartialEq
  #[repr(u8)]
  pub enum LogError {
      /// The log is full.
      Full,
      /// The message to log was malformed (e.g., too long)
      Malformed,
  }

  #[cfg_attr(feature = "creusot", logic)]
  #[ensures(result != 0i32)]
  pub fn reject_impl_from_log_error(le: LogError) -> Reject {
      match le {
	  LogError::Full => i32::MIN + 3i32,
	  LogError::Malformed => i32::MIN + 4i32,
      }
  }

#+end_src
We define a type for new contract name errors and conversion from it to reject
#+begin_src rust :tangle ../../examples/concordium_impls/src/concordium_impls.rs :eval never
  #[derive(Clone)] // , Debug, PartialEq, Eq
  pub enum NewContractNameError {
      NewContractNameErrorMissingInitPrefix,
      NewContractNameErrorTooLong,
      NewContractNameErrorContainsDot,
      NewContractNameErrorInvalidCharacters,
  }

  #[cfg_attr(feature = "creusot", logic)]
  #[ensures(result != 0i32)]
  pub fn reject_impl_from_new_contract_name_error(nre: NewContractNameError) -> Reject {
      match nre {
	  NewContractNameError::NewContractNameErrorMissingInitPrefix => i32::MIN + 5i32,
	  NewContractNameError::NewContractNameErrorTooLong => i32::MIN + 6i32,
	  NewContractNameError::NewContractNameErrorContainsDot => i32::MIN + 9i32,
	  NewContractNameError::NewContractNameErrorInvalidCharacters => i32::MIN + 10i32,
      }
  }

#+end_src
We define a type for new receive name errors and conversion from it to reject
#+begin_src rust :tangle ../../examples/concordium_impls/src/concordium_impls.rs :eval never
  #[derive(Clone)] // , Debug, PartialEq, Eq
  pub enum NewReceiveNameError {
      NewReceiveNameErrorMissingDotSeparator,
      NewReceiveNameErrorTooLong,
      NewReceiveNameErrorInvalidCharacters,
  }

  #[cfg_attr(feature = "creusot", logic)]
  #[ensures(result != 0i32)]
  pub fn reject_impl_from_new_receive_name_error(nre: NewReceiveNameError) -> Reject {
      match nre {
	  NewReceiveNameError::NewReceiveNameErrorMissingDotSeparator => i32::MIN + 7i32,
	  NewReceiveNameError::NewReceiveNameErrorTooLong => i32::MIN + 8i32,
	  NewReceiveNameError::NewReceiveNameErrorInvalidCharacters => i32::MIN + 11i32,
      }
  }

#+end_src
