coq/src/concordium_impls.html
<li><a id="orga185296"></a>Reject - From trait<br />
<div class="outline-text-5" id="text-1-3-1-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #b3b3b3;">impl</span> <span style="color: #87ceeb;">convert</span>::<span style="color: #00ff00;">From</span><span style="color: #7d26cd;">&lt;</span><span style="color: #cd0000;">()</span><span style="color: #7d26cd;">&gt;</span> <span style="color: #b3b3b3;">for</span> <span style="color: #00ff00;">Reject</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #4169e1;">#</span><span style="color: #cd0000;">[</span><span style="color: #4169e1;">inline</span><span style="color: #cd8500;">(</span><span style="color: #4169e1;">always</span><span style="color: #cd8500;">)</span><span style="color: #cd0000;">]</span>
    <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">from</span><span style="color: #cd0000;">(</span><span style="color: #9acd32;">_</span>: <span style="color: #cd8500;">()</span><span style="color: #cd0000;">)</span> -&gt; <span style="color: #00ff00;">Self</span> <span style="color: #cd0000;">{</span>
        <span style="color: #00ff00;">Reject</span> <span style="color: #cd8500;">{</span>
            <span style="color: #9acd32;">error_code</span>: <span style="color: #ff8c69;">unsafe</span> <span style="color: #cdcd00;">{</span> <span style="color: #87ceeb;">num</span>::<span style="color: #00ff00;">NonZeroI32</span>::new_unchecked<span style="color: #00cd00;">(</span><span style="color: #00ff00;">i32</span>::<span style="color: #00ff00;">MIN</span> + 1<span style="color: #00cd00;">)</span> <span style="color: #cdcd00;">}</span>,
        <span style="color: #cd8500;">}</span>
    <span style="color: #cd0000;">}</span>
<span style="color: #7d26cd;">}</span>

<span style="color: #b3b3b3;">impl</span> <span style="color: #87ceeb;">convert</span>::<span style="color: #00ff00;">From</span><span style="color: #7d26cd;">&lt;</span><span style="color: #00ff00;">ParseError</span><span style="color: #7d26cd;">&gt;</span> <span style="color: #b3b3b3;">for</span> <span style="color: #00ff00;">Reject</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #4169e1;">#</span><span style="color: #cd0000;">[</span><span style="color: #4169e1;">inline</span><span style="color: #cd8500;">(</span><span style="color: #4169e1;">always</span><span style="color: #cd8500;">)</span><span style="color: #cd0000;">]</span>
    <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">from</span><span style="color: #cd0000;">(</span><span style="color: #9acd32;">_</span>: <span style="color: #00ff00;">ParseError</span><span style="color: #cd0000;">)</span> -&gt; <span style="color: #00ff00;">Self</span> <span style="color: #cd0000;">{</span>
        <span style="color: #00ff00;">Reject</span> <span style="color: #cd8500;">{</span>
            <span style="color: #9acd32;">error_code</span>: <span style="color: #ff8c69;">unsafe</span> <span style="color: #cdcd00;">{</span> <span style="color: #87ceeb;">num</span>::<span style="color: #00ff00;">NonZeroI32</span>::new_unchecked<span style="color: #00cd00;">(</span><span style="color: #00ff00;">i32</span>::<span style="color: #00ff00;">MIN</span> + 2<span style="color: #00cd00;">)</span> <span style="color: #cdcd00;">}</span>,
        <span style="color: #cd8500;">}</span>
    <span style="color: #cd0000;">}</span>
<span style="color: #7d26cd;">}</span>
</pre>
</div>

<p>
We modle the unsafe block with unchecked non zero as a precondition using requires giving us the hacspec equivalent
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, logic</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">ensures</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">result != 0i32</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">reject_impl_convert_from_unit</span><span style="color: #7d26cd;">()</span> -&gt; <span style="color: #00ff00;">Reject</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #00ff00;">i32</span>::<span style="color: #00ff00;">MIN</span> + 1i32
<span style="color: #7d26cd;">}</span>

<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, logic</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">ensures</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">result != 0i32</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">reject_impl_convert_from_parse_error</span><span style="color: #7d26cd;">()</span> -&gt; <span style="color: #00ff00;">Reject</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #00ff00;">i32</span>::<span style="color: #00ff00;">MIN</span> + 2i32
<span style="color: #7d26cd;">}</span>
</pre>
</div>
<p>
which we can insert as the definition of the from functions in the trait implementation by using a coerce function
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">coerce_hacspec_to_rust_reject</span><span style="color: #7d26cd;">(</span><span style="color: #9acd32;">hacspec_reject</span>: <span style="color: #00ff00;">ConcordiumImpls</span>::<span style="color: #00ff00;">Reject</span><span style="color: #7d26cd;">)</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #00ff00;">Reject</span> <span style="color: #cd0000;">{</span>
        <span style="color: #9acd32;">error_code</span>: hacspec_reject,
    <span style="color: #cd0000;">}</span>
<span style="color: #7d26cd;">}</span>
</pre>
</div>
<p>
We define a log error type and function converting from it to the reject type
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: light orange;">/// Errors that can occur during logging.</span>
<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">derive</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">Copy, Clone</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span> <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">, Debug, Eq, PartialEq</span>
<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">repr</span><span style="color: #cd0000;">(</span><span style="color: #00ff00;">u8</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">enum</span> <span style="color: #00ff00;">LogError</span> <span style="color: #7d26cd;">{</span>
    <span style="color: light orange;">/// The log is full.</span>
    <span style="color: #00ff00;">Full</span>,
    <span style="color: light orange;">/// The message to log was malformed (e.g., too long)</span>
    <span style="color: #00ff00;">Malformed</span>,
<span style="color: #7d26cd;">}</span>

<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, logic</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">ensures</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">result != 0i32</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">reject_impl_from_log_error</span><span style="color: #7d26cd;">(</span><span style="color: #9acd32;">le</span>: <span style="color: #00ff00;">LogError</span><span style="color: #7d26cd;">)</span> -&gt; <span style="color: #00ff00;">Reject</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #b3b3b3;">match</span> le <span style="color: #cd0000;">{</span>
        <span style="color: #00ff00;">LogError</span>::<span style="color: #00ff00;">Full</span> =&gt; <span style="color: #00ff00;">i32</span>::<span style="color: #00ff00;">MIN</span> + 3i32,
        <span style="color: #00ff00;">LogError</span>::<span style="color: #00ff00;">Malformed</span> =&gt; <span style="color: #00ff00;">i32</span>::<span style="color: #00ff00;">MIN</span> + 4i32,
    <span style="color: #cd0000;">}</span>
<span style="color: #7d26cd;">}</span>

</pre>
</div>
<p>
We define a type for new contract name errors and conversion from it to reject
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">derive</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">Clone</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span> <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">, Debug, PartialEq, Eq</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">enum</span> <span style="color: #00ff00;">NewContractNameError</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #00ff00;">NewContractNameErrorMissingInitPrefix</span>,
    <span style="color: #00ff00;">NewContractNameErrorTooLong</span>,
    <span style="color: #00ff00;">NewContractNameErrorContainsDot</span>,
    <span style="color: #00ff00;">NewContractNameErrorInvalidCharacters</span>,
<span style="color: #7d26cd;">}</span>

<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, logic</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">ensures</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">result != 0i32</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">reject_impl_from_new_contract_name_error</span><span style="color: #7d26cd;">(</span><span style="color: #9acd32;">nre</span>: <span style="color: #00ff00;">NewContractNameError</span><span style="color: #7d26cd;">)</span> -&gt; <span style="color: #00ff00;">Reject</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #b3b3b3;">match</span> nre <span style="color: #cd0000;">{</span>
        <span style="color: #00ff00;">NewContractNameError</span>::<span style="color: #00ff00;">NewContractNameErrorMissingInitPrefix</span> =&gt; <span style="color: #00ff00;">i32</span>::<span style="color: #00ff00;">MIN</span> + 5i32,
        <span style="color: #00ff00;">NewContractNameError</span>::<span style="color: #00ff00;">NewContractNameErrorTooLong</span> =&gt; <span style="color: #00ff00;">i32</span>::<span style="color: #00ff00;">MIN</span> + 6i32,
        <span style="color: #00ff00;">NewContractNameError</span>::<span style="color: #00ff00;">NewContractNameErrorContainsDot</span> =&gt; <span style="color: #00ff00;">i32</span>::<span style="color: #00ff00;">MIN</span> + 9i32,
        <span style="color: #00ff00;">NewContractNameError</span>::<span style="color: #00ff00;">NewContractNameErrorInvalidCharacters</span> =&gt; <span style="color: #00ff00;">i32</span>::<span style="color: #00ff00;">MIN</span> + 10i32,
    <span style="color: #cd0000;">}</span>
<span style="color: #7d26cd;">}</span>

</pre>
</div>
<p>
We define a type for new receive name errors and conversion from it to reject
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">derive</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">Clone</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span> <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">, Debug, PartialEq, Eq</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">enum</span> <span style="color: #00ff00;">NewReceiveNameError</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #00ff00;">NewReceiveNameErrorMissingDotSeparator</span>,
    <span style="color: #00ff00;">NewReceiveNameErrorTooLong</span>,
    <span style="color: #00ff00;">NewReceiveNameErrorInvalidCharacters</span>,
<span style="color: #7d26cd;">}</span>

<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, logic</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">ensures</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">result != 0i32</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">reject_impl_from_new_receive_name_error</span><span style="color: #7d26cd;">(</span><span style="color: #9acd32;">nre</span>: <span style="color: #00ff00;">NewReceiveNameError</span><span style="color: #7d26cd;">)</span> -&gt; <span style="color: #00ff00;">Reject</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #b3b3b3;">match</span> nre <span style="color: #cd0000;">{</span>
        <span style="color: #00ff00;">NewReceiveNameError</span>::<span style="color: #00ff00;">NewReceiveNameErrorMissingDotSeparator</span> =&gt; <span style="color: #00ff00;">i32</span>::<span style="color: #00ff00;">MIN</span> + 7i32,
        <span style="color: #00ff00;">NewReceiveNameError</span>::<span style="color: #00ff00;">NewReceiveNameErrorTooLong</span> =&gt; <span style="color: #00ff00;">i32</span>::<span style="color: #00ff00;">MIN</span> + 8i32,
        <span style="color: #00ff00;">NewReceiveNameError</span>::<span style="color: #00ff00;">NewReceiveNameErrorInvalidCharacters</span> =&gt; <span style="color: #00ff00;">i32</span>::<span style="color: #00ff00;">MIN</span> + 11i32,
    <span style="color: #cd0000;">}</span>
<span style="color: #7d26cd;">}</span>

</pre>
</div>
</div>
</li>
</ol>
</div>
