coq/src/concordium_impls.html
<div id="outline-container-org88fe0ea" class="outline-4">
<h4 id="org88fe0ea"><span class="section-number-4">1.3.2.</span> Contract state</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
We define contract state as its inner state namely the current position of the type.
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">type</span> <span style="color: #00ff00;">ContractState</span> = <span style="color: #00ff00;">u32</span>;

</pre>
</div>
</div>
<ol class="org-ol">
