coq/src/concordium_impls.org
**** Contract State -- Seek
#+begin_src rust :tangle ../../examples/concordium_impls/src/concordium_impls.rs :eval never
  pub type SeekResult = Result<(ContractState, u64), ()>;

  #[derive(Copy, Clone)] // , Debug, PartialEq, Eq
  pub enum SeekFrom {
      /// Sets the offset to the provided number of bytes.
      Start(u64),

      /// Sets the offset to the size of this object plus the specified number of
      /// bytes.
      ///
      /// It is possible to seek beyond the end of an object, but it's an error to
      /// seek before byte 0.
      End(i64),

      /// Sets the offset to the current position plus the specified number of
      /// bytes.
      ///
      /// It is possible to seek beyond the end of an object, but it's an error to
      /// seek before byte 0.
      Current(i64),
  }

  pub type U32Option = Option<u32>;
  pub type I64Option = Option<i64>;

  #[cfg_attr(feature = "creusot", trusted)]
  #[requires(forall<delta : i64> pos === SeekFrom::End(delta) ==> exists<b : u32> current_position.checked_add(delta as u32) == U32Option::Some(b))]
  pub fn contract_state_impl_seek(current_position: ContractState, pos: SeekFrom) -> SeekResult {
      match pos {
	  SeekFrom::Start(offset) => SeekResult::Ok((offset as u32, offset)),
	  SeekFrom::End(delta) => {
	      if delta >= 0_i64 {
		  match current_position.checked_add(delta as u32) {
		      U32Option::Some(b) => SeekResult::Ok((b, delta as u64)),
		      U32Option::None => SeekResult::Err(()),
		  }
	      } else {
		  match delta.checked_abs() {
		      I64Option::Some(b) =>
		      // {
		      // let new_pos = 4_u32 - (b as u32);
		      {
			  SeekResult::Ok(((4_u32 - (b as u32)), (4_u32 - (b as u32)) as u64))
		      }
		      // }
		      I64Option::None => SeekResult::Err(()),
		  }
	      }
	  }
	  SeekFrom::Current(delta) => {
	      if delta >= 0_i64 {
		  match current_position.checked_add(delta as u32) {
		      U32Option::Some(offset) => SeekResult::Ok((offset, offset as u64)),
		      U32Option::None => SeekResult::Err(()),
		  }
	      } else {
		  match delta.checked_abs() {
		      I64Option::Some(b) => match current_position.checked_sub(b as u32) {
			  U32Option::Some(offset) => SeekResult::Ok((offset, offset as u64)),
			  U32Option::None => SeekResult::Err(()),
		      },
		      I64Option::None => SeekResult::Err(()),
		  }
	      }
	  }
      }
  }
#+end_src
