coq/src/concordium_impls.html
<li><a id="org6df5143"></a>Contract State &#x2013; Seek<br />
<div class="outline-text-5" id="text-1-3-2-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">type</span> <span style="color: #00ff00;">SeekResult</span> = <span style="color: #00ff00;">Result</span><span style="color: #7d26cd;">&lt;</span><span style="color: #cd0000;">(</span><span style="color: #00ff00;">ContractState</span>, <span style="color: #00ff00;">u64</span><span style="color: #cd0000;">)</span>, <span style="color: #cd0000;">()</span><span style="color: #7d26cd;">&gt;</span>;

<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">derive</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">Copy, Clone</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span> <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">, Debug, PartialEq, Eq</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">enum</span> <span style="color: #00ff00;">SeekFrom</span> <span style="color: #7d26cd;">{</span>
    <span style="color: light orange;">/// Sets the offset to the provided number of bytes.</span>
    <span style="color: #00ff00;">Start</span><span style="color: #cd0000;">(</span><span style="color: #00ff00;">u64</span><span style="color: #cd0000;">)</span>,

    <span style="color: light orange;">/// Sets the offset to the size of this object plus the specified number of</span>
    <span style="color: light orange;">/// bytes.</span>
    <span style="color: light orange;">///</span>
    <span style="color: light orange;">/// It is possible to seek beyond the end of an object, but it's an error to</span>
    <span style="color: light orange;">/// seek before byte 0.</span>
    <span style="color: #00ff00;">End</span><span style="color: #cd0000;">(</span><span style="color: #00ff00;">i64</span><span style="color: #cd0000;">)</span>,

    <span style="color: light orange;">/// Sets the offset to the current position plus the specified number of</span>
    <span style="color: light orange;">/// bytes.</span>
    <span style="color: light orange;">///</span>
    <span style="color: light orange;">/// It is possible to seek beyond the end of an object, but it's an error to</span>
    <span style="color: light orange;">/// seek before byte 0.</span>
    <span style="color: #00ff00;">Current</span><span style="color: #cd0000;">(</span><span style="color: #00ff00;">i64</span><span style="color: #cd0000;">)</span>,
<span style="color: #7d26cd;">}</span>

<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">type</span> <span style="color: #00ff00;">U32Option</span> = <span style="color: #00ff00;">Option</span><span style="color: #7d26cd;">&lt;</span><span style="color: #00ff00;">u32</span><span style="color: #7d26cd;">&gt;</span>;
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">type</span> <span style="color: #00ff00;">I64Option</span> = <span style="color: #00ff00;">Option</span><span style="color: #7d26cd;">&lt;</span><span style="color: #00ff00;">i64</span><span style="color: #7d26cd;">&gt;</span>;

<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, trusted</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">requires</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">forall</span><span style="color: #cd8500;">&lt;</span><span style="color: #4169e1;">delta : </span><span style="color: #00ff00;">i64</span><span style="color: #cd8500;">&gt;</span><span style="color: #4169e1;"> pos === SeekFrom::End</span><span style="color: #cd8500;">(</span><span style="color: #4169e1;">delta</span><span style="color: #cd8500;">)</span><span style="color: #4169e1;"> ==&gt; exists&lt;b : </span><span style="color: #00ff00;">u32</span><span style="color: #4169e1;">&gt; current_position.checked_add</span><span style="color: #cd8500;">(</span><span style="color: #4169e1;">delta </span><span style="color: #b3b3b3;">as</span><span style="color: #4169e1;"> </span><span style="color: #00ff00;">u32</span><span style="color: #cd8500;">)</span><span style="color: #4169e1;"> == U32Option::Some</span><span style="color: #cd8500;">(</span><span style="color: #4169e1;">b</span><span style="color: #cd8500;">)</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">contract_state_impl_seek</span><span style="color: #7d26cd;">(</span><span style="color: #9acd32;">current_position</span>: <span style="color: #00ff00;">ContractState</span>, <span style="color: #9acd32;">pos</span>: <span style="color: #00ff00;">SeekFrom</span><span style="color: #7d26cd;">)</span> -&gt; <span style="color: #00ff00;">SeekResult</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #b3b3b3;">match</span> pos <span style="color: #cd0000;">{</span>
        <span style="color: #00ff00;">SeekFrom</span>::<span style="color: #00ff00;">Start</span><span style="color: #cd8500;">(</span>offset<span style="color: #cd8500;">)</span> =&gt; <span style="color: #00ff00;">SeekResult</span>::<span style="color: #00ff00;">Ok</span><span style="color: #cd8500;">(</span><span style="color: #cdcd00;">(</span>offset <span style="color: #b3b3b3;">as</span> <span style="color: #00ff00;">u32</span>, offset<span style="color: #cdcd00;">)</span><span style="color: #cd8500;">)</span>,
        <span style="color: #00ff00;">SeekFrom</span>::<span style="color: #00ff00;">End</span><span style="color: #cd8500;">(</span>delta<span style="color: #cd8500;">)</span> =&gt; <span style="color: #cd8500;">{</span>
            <span style="color: #b3b3b3;">if</span> delta &gt;= 0_i64 <span style="color: #cdcd00;">{</span>
                <span style="color: #b3b3b3;">match</span> current_position.checked_add<span style="color: #00cd00;">(</span>delta <span style="color: #b3b3b3;">as</span> <span style="color: #00ff00;">u32</span><span style="color: #00cd00;">)</span> <span style="color: #00cd00;">{</span>
                    <span style="color: #00ff00;">U32Option</span>::<span style="color: #00ff00;">Some</span><span style="color: #00cdcd;">(</span>b<span style="color: #00cdcd;">)</span> =&gt; <span style="color: #00ff00;">SeekResult</span>::<span style="color: #00ff00;">Ok</span><span style="color: #00cdcd;">(</span><span style="color: #0000cd;">(</span>b, delta <span style="color: #b3b3b3;">as</span> <span style="color: #00ff00;">u64</span><span style="color: #0000cd;">)</span><span style="color: #00cdcd;">)</span>,
                    <span style="color: #00ff00;">U32Option</span>::<span style="color: #00ff00;">None</span> =&gt; <span style="color: #00ff00;">SeekResult</span>::<span style="color: #00ff00;">Err</span><span style="color: #00cdcd;">(</span><span style="color: #0000cd;">()</span><span style="color: #00cdcd;">)</span>,
                <span style="color: #00cd00;">}</span>
            <span style="color: #cdcd00;">}</span> <span style="color: #b3b3b3;">else</span> <span style="color: #cdcd00;">{</span>
                <span style="color: #b3b3b3;">match</span> delta.checked_abs<span style="color: #00cd00;">()</span> <span style="color: #00cd00;">{</span>
                    <span style="color: #00ff00;">I64Option</span>::<span style="color: #00ff00;">Some</span><span style="color: #00cdcd;">(</span>b<span style="color: #00cdcd;">)</span> =&gt;
                    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">{</span>
                    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">let new_pos = 4_u32 - (b as u32);</span>
                    <span style="color: #00cdcd;">{</span>
                        <span style="color: #00ff00;">SeekResult</span>::<span style="color: #00ff00;">Ok</span><span style="color: #0000cd;">(</span><span style="color: #cd00cd;">(</span><span style="color: #cd1076;">(</span>4_u32 - <span style="color: #7d26cd;">(</span>b <span style="color: #b3b3b3;">as</span> <span style="color: #00ff00;">u32</span><span style="color: #7d26cd;">)</span><span style="color: #cd1076;">)</span>, <span style="color: #cd1076;">(</span>4_u32 - <span style="color: #7d26cd;">(</span>b <span style="color: #b3b3b3;">as</span> <span style="color: #00ff00;">u32</span><span style="color: #7d26cd;">)</span><span style="color: #cd1076;">)</span> <span style="color: #b3b3b3;">as</span> <span style="color: #00ff00;">u64</span><span style="color: #cd00cd;">)</span><span style="color: #0000cd;">)</span>
                    <span style="color: #00cdcd;">}</span>
                    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">}</span>
                    <span style="color: #00ff00;">I64Option</span>::<span style="color: #00ff00;">None</span> =&gt; <span style="color: #00ff00;">SeekResult</span>::<span style="color: #00ff00;">Err</span><span style="color: #00cdcd;">(</span><span style="color: #0000cd;">()</span><span style="color: #00cdcd;">)</span>,
                <span style="color: #00cd00;">}</span>
            <span style="color: #cdcd00;">}</span>
        <span style="color: #cd8500;">}</span>
        <span style="color: #00ff00;">SeekFrom</span>::<span style="color: #00ff00;">Current</span><span style="color: #cd8500;">(</span>delta<span style="color: #cd8500;">)</span> =&gt; <span style="color: #cd8500;">{</span>
            <span style="color: #b3b3b3;">if</span> delta &gt;= 0_i64 <span style="color: #cdcd00;">{</span>
                <span style="color: #b3b3b3;">match</span> current_position.checked_add<span style="color: #00cd00;">(</span>delta <span style="color: #b3b3b3;">as</span> <span style="color: #00ff00;">u32</span><span style="color: #00cd00;">)</span> <span style="color: #00cd00;">{</span>
                    <span style="color: #00ff00;">U32Option</span>::<span style="color: #00ff00;">Some</span><span style="color: #00cdcd;">(</span>offset<span style="color: #00cdcd;">)</span> =&gt; <span style="color: #00ff00;">SeekResult</span>::<span style="color: #00ff00;">Ok</span><span style="color: #00cdcd;">(</span><span style="color: #0000cd;">(</span>offset, offset <span style="color: #b3b3b3;">as</span> <span style="color: #00ff00;">u64</span><span style="color: #0000cd;">)</span><span style="color: #00cdcd;">)</span>,
                    <span style="color: #00ff00;">U32Option</span>::<span style="color: #00ff00;">None</span> =&gt; <span style="color: #00ff00;">SeekResult</span>::<span style="color: #00ff00;">Err</span><span style="color: #00cdcd;">(</span><span style="color: #0000cd;">()</span><span style="color: #00cdcd;">)</span>,
                <span style="color: #00cd00;">}</span>
            <span style="color: #cdcd00;">}</span> <span style="color: #b3b3b3;">else</span> <span style="color: #cdcd00;">{</span>
                <span style="color: #b3b3b3;">match</span> delta.checked_abs<span style="color: #00cd00;">()</span> <span style="color: #00cd00;">{</span>
                    <span style="color: #00ff00;">I64Option</span>::<span style="color: #00ff00;">Some</span><span style="color: #00cdcd;">(</span>b<span style="color: #00cdcd;">)</span> =&gt; <span style="color: #b3b3b3;">match</span> current_position.checked_sub<span style="color: #00cdcd;">(</span>b <span style="color: #b3b3b3;">as</span> <span style="color: #00ff00;">u32</span><span style="color: #00cdcd;">)</span> <span style="color: #00cdcd;">{</span>
                        <span style="color: #00ff00;">U32Option</span>::<span style="color: #00ff00;">Some</span><span style="color: #0000cd;">(</span>offset<span style="color: #0000cd;">)</span> =&gt; <span style="color: #00ff00;">SeekResult</span>::<span style="color: #00ff00;">Ok</span><span style="color: #0000cd;">(</span><span style="color: #cd00cd;">(</span>offset, offset <span style="color: #b3b3b3;">as</span> <span style="color: #00ff00;">u64</span><span style="color: #cd00cd;">)</span><span style="color: #0000cd;">)</span>,
                        <span style="color: #00ff00;">U32Option</span>::<span style="color: #00ff00;">None</span> =&gt; <span style="color: #00ff00;">SeekResult</span>::<span style="color: #00ff00;">Err</span><span style="color: #0000cd;">(</span><span style="color: #cd00cd;">()</span><span style="color: #0000cd;">)</span>,
                    <span style="color: #00cdcd;">}</span>,
                    <span style="color: #00ff00;">I64Option</span>::<span style="color: #00ff00;">None</span> =&gt; <span style="color: #00ff00;">SeekResult</span>::<span style="color: #00ff00;">Err</span><span style="color: #00cdcd;">(</span><span style="color: #0000cd;">()</span><span style="color: #00cdcd;">)</span>,
                <span style="color: #00cd00;">}</span>
            <span style="color: #cdcd00;">}</span>
        <span style="color: #cd8500;">}</span>
    <span style="color: #cd0000;">}</span>
<span style="color: #7d26cd;">}</span>
</pre>
</div>
</div>
</li>
