coq/src/concordium_impls.org
**** Contract State -- Load
#+begin_src rust :tangle ../../examples/concordium_impls/src/concordium_impls.rs :eval never
  #[cfg(not(feature = "hacspec"))]
  extern "C" {
      pub(crate) fn load_state(start: *mut u8, length: u32, offset: u32) -> u32;
  }

  // #[cfg(feature = "hacspec")]
  // #[cfg_attr(feature = "creusot", trusted)]
  // #[requires(offset < buf.len())]
  #[cfg(feature = "hacspec")]
  #[ensures(result != (buf, 2u32))] // forall<b : u32> result = (buf,b) ==> 0u32 < offset + b
  fn load_state_hacspec(buf : PublicByteSeq, offset: u32) -> (PublicByteSeq, u32) {
      (buf, 1u32)
  }

  #[cfg(not(feature = "hacspec"))]
  fn load_state_hacspec(buf : PublicByteSeq, offset: u32) -> (PublicByteSeq, u32) {
      let mut temp_vec : Vec<u8> = (0..buf.len()).map(|i| {
	  buf.index(i).clone()
      }).collect();
      let temp = &mut temp_vec[..];
      let i = unsafe { load_state(temp.as_mut_ptr(), buf.len() as u32, offset) };
      (PublicByteSeq::from_native_slice(temp), i)
  }

#+end_src
**** Contract State -- Read
#+begin_src rust :tangle ../../examples/concordium_impls/src/concordium_impls.rs :eval never
  #[cfg_attr(feature = "creusot", trusted)]
  pub fn contract_state_impl_read_read(
      current_position: ContractState,
      buf : PublicByteSeq // Seq<u8>
      // num_read: u32,
  ) -> (ContractState, usize) {
      let (buf, num_read) = load_state_hacspec(buf, current_position);
      (current_position + num_read, num_read as usize)
  }

  /// Read a u32 in little-endian format. This is optimized to not
  /// initialize a dummy value before calling an external function.
  #[cfg_attr(feature = "creusot", logic)]
  pub fn contract_state_impl_read_read_u64(
      current_position: ContractState,
      num_read: u32,
  ) -> (ContractState, bool) {
      (current_position + num_read, num_read == 8_u32)
  }

  /// Read a u32 in little-endian format. This is optimized to not
  /// initialize a dummy value before calling an external function.
  #[cfg_attr(feature = "creusot", logic)]
  pub fn contract_state_impl_read_read_u32(
      current_position: ContractState,
      num_read: u32,
  ) -> (ContractState, bool) {
      (current_position + num_read, num_read == 4_u32)
  }

  /// Read a u8 in little-endian format. This is optimized to not
  /// initialize a dummy value before calling an external function.
  #[cfg_attr(feature = "creusot", logic)]
  pub fn contract_state_impl_read_read_u8(
      current_position: ContractState,
      num_read: u32,
  ) -> (ContractState, bool) {
      (current_position + num_read, num_read == 1_u32)
  }

#+end_src
