coq/src/concordium_impls.html
<li><a id="org61ee22d"></a>Contract State &#x2013; Load<br />
<div class="outline-text-5" id="text-1-3-2-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">not</span><span style="color: #cd8500;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"hacspec"</span><span style="color: #cd8500;">)</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">extern</span> <span style="color: #bdb76b;">"C"</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #b3b3b3;">pub</span><span style="color: #cd0000;">(</span><span style="color: #b3b3b3;">crate</span><span style="color: #cd0000;">)</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">load_state</span><span style="color: #cd0000;">(</span><span style="color: #9acd32;">start</span>: *<span style="color: #b3b3b3;">mut</span> <span style="color: #00ff00;">u8</span>, <span style="color: #9acd32;">length</span>: <span style="color: #00ff00;">u32</span>, <span style="color: #9acd32;">offset</span>: <span style="color: #00ff00;">u32</span><span style="color: #cd0000;">)</span> -&gt; <span style="color: #00ff00;">u32</span>;
<span style="color: #7d26cd;">}</span>

<span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">#[cfg(feature = "hacspec")]</span>
<span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">#[cfg_attr(feature = "creusot", trusted)]</span>
<span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">#[requires(offset &lt; buf.len())]</span>
<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"hacspec"</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">ensures</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">result != </span><span style="color: #cd8500;">(</span><span style="color: #4169e1;">buf, 2u32</span><span style="color: #cd8500;">)</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span> <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">forall&lt;b : u32&gt; result = (buf,b) ==&gt; 0u32 &lt; offset + b</span>
<span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">load_state_hacspec</span><span style="color: #7d26cd;">(</span><span style="color: #9acd32;">buf</span> : <span style="color: #00ff00;">PublicByteSeq</span>, <span style="color: #9acd32;">offset</span>: <span style="color: #00ff00;">u32</span><span style="color: #7d26cd;">)</span> -&gt; <span style="color: #7d26cd;">(</span><span style="color: #00ff00;">PublicByteSeq</span>, <span style="color: #00ff00;">u32</span><span style="color: #7d26cd;">)</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #cd0000;">(</span>buf, 1u32<span style="color: #cd0000;">)</span>
<span style="color: #7d26cd;">}</span>

<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">not</span><span style="color: #cd8500;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"hacspec"</span><span style="color: #cd8500;">)</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">load_state_hacspec</span><span style="color: #7d26cd;">(</span><span style="color: #9acd32;">buf</span> : <span style="color: #00ff00;">PublicByteSeq</span>, <span style="color: #9acd32;">offset</span>: <span style="color: #00ff00;">u32</span><span style="color: #7d26cd;">)</span> -&gt; <span style="color: #7d26cd;">(</span><span style="color: #00ff00;">PublicByteSeq</span>, <span style="color: #00ff00;">u32</span><span style="color: #7d26cd;">)</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #b3b3b3;">let</span> <span style="color: #b3b3b3;">mut</span> <span style="color: #9acd32;">temp_vec</span> : <span style="color: #00ff00;">Vec</span><span style="color: #cd0000;">&lt;</span><span style="color: #00ff00;">u8</span><span style="color: #cd0000;">&gt;</span> = <span style="color: #cd0000;">(</span>0..buf.len<span style="color: #cd8500;">()</span><span style="color: #cd0000;">)</span>.map<span style="color: #cd0000;">(</span>|i| <span style="color: #cd8500;">{</span>
        buf.index<span style="color: #cdcd00;">(</span>i<span style="color: #cdcd00;">)</span>.clone<span style="color: #cdcd00;">()</span>
    <span style="color: #cd8500;">}</span><span style="color: #cd0000;">)</span>.collect<span style="color: #cd0000;">()</span>;
    <span style="color: #b3b3b3;">let</span> <span style="color: #9acd32;">temp</span> = &amp;<span style="color: #b3b3b3;">mut</span> temp_vec<span style="color: #cd0000;">[</span>..<span style="color: #cd0000;">]</span>;
    <span style="color: #b3b3b3;">let</span> <span style="color: #9acd32;">i</span> = <span style="color: #ff8c69;">unsafe</span> <span style="color: #cd0000;">{</span> load_state<span style="color: #cd8500;">(</span>temp.as_mut_ptr<span style="color: #cdcd00;">()</span>, buf.len<span style="color: #cdcd00;">()</span> <span style="color: #b3b3b3;">as</span> <span style="color: #00ff00;">u32</span>, offset<span style="color: #cd8500;">)</span> <span style="color: #cd0000;">}</span>;
    <span style="color: #cd0000;">(</span><span style="color: #00ff00;">PublicByteSeq</span>::from_native_slice<span style="color: #cd8500;">(</span>temp<span style="color: #cd8500;">)</span>, i<span style="color: #cd0000;">)</span>
<span style="color: #7d26cd;">}</span>

</pre>
</div>
</div>
</li>
<li><a id="org5558ce8"></a>Contract State &#x2013; Read<br />
<div class="outline-text-5" id="text-1-3-2-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, trusted</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">contract_state_impl_read_read</span><span style="color: #7d26cd;">(</span>
    <span style="color: #9acd32;">current_position</span>: <span style="color: #00ff00;">ContractState</span>,
    <span style="color: #9acd32;">buf</span> : <span style="color: #00ff00;">PublicByteSeq</span> <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Seq&lt;u8&gt;</span>
    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">num_read: u32,</span>
<span style="color: #7d26cd;">)</span> -&gt; <span style="color: #7d26cd;">(</span><span style="color: #00ff00;">ContractState</span>, <span style="color: #00ff00;">usize</span><span style="color: #7d26cd;">)</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #b3b3b3;">let</span> <span style="color: #cd0000;">(</span>buf, num_read<span style="color: #cd0000;">)</span> = load_state_hacspec<span style="color: #cd0000;">(</span>buf, current_position<span style="color: #cd0000;">)</span>;
    <span style="color: #cd0000;">(</span>current_position + num_read, num_read <span style="color: #b3b3b3;">as</span> <span style="color: #00ff00;">usize</span><span style="color: #cd0000;">)</span>
<span style="color: #7d26cd;">}</span>

<span style="color: light orange;">/// Read a u32 in little-endian format. This is optimized to not</span>
<span style="color: light orange;">/// initialize a dummy value before calling an external function.</span>
<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, logic</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">contract_state_impl_read_read_u64</span><span style="color: #7d26cd;">(</span>
    <span style="color: #9acd32;">current_position</span>: <span style="color: #00ff00;">ContractState</span>,
    <span style="color: #9acd32;">num_read</span>: <span style="color: #00ff00;">u32</span>,
<span style="color: #7d26cd;">)</span> -&gt; <span style="color: #7d26cd;">(</span><span style="color: #00ff00;">ContractState</span>, <span style="color: #00ff00;">bool</span><span style="color: #7d26cd;">)</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #cd0000;">(</span>current_position + num_read, num_read == 8_u32<span style="color: #cd0000;">)</span>
<span style="color: #7d26cd;">}</span>

<span style="color: light orange;">/// Read a u32 in little-endian format. This is optimized to not</span>
<span style="color: light orange;">/// initialize a dummy value before calling an external function.</span>
<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, logic</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">contract_state_impl_read_read_u32</span><span style="color: #7d26cd;">(</span>
    <span style="color: #9acd32;">current_position</span>: <span style="color: #00ff00;">ContractState</span>,
    <span style="color: #9acd32;">num_read</span>: <span style="color: #00ff00;">u32</span>,
<span style="color: #7d26cd;">)</span> -&gt; <span style="color: #7d26cd;">(</span><span style="color: #00ff00;">ContractState</span>, <span style="color: #00ff00;">bool</span><span style="color: #7d26cd;">)</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #cd0000;">(</span>current_position + num_read, num_read == 4_u32<span style="color: #cd0000;">)</span>
<span style="color: #7d26cd;">}</span>

<span style="color: light orange;">/// Read a u8 in little-endian format. This is optimized to not</span>
<span style="color: light orange;">/// initialize a dummy value before calling an external function.</span>
<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, logic</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">contract_state_impl_read_read_u8</span><span style="color: #7d26cd;">(</span>
    <span style="color: #9acd32;">current_position</span>: <span style="color: #00ff00;">ContractState</span>,
    <span style="color: #9acd32;">num_read</span>: <span style="color: #00ff00;">u32</span>,
<span style="color: #7d26cd;">)</span> -&gt; <span style="color: #7d26cd;">(</span><span style="color: #00ff00;">ContractState</span>, <span style="color: #00ff00;">bool</span><span style="color: #7d26cd;">)</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #cd0000;">(</span>current_position + num_read, num_read == 1_u32<span style="color: #cd0000;">)</span>
<span style="color: #7d26cd;">}</span>

</pre>
</div>
</div>
</li>
