coq/src/concordium_impls.org
**** Contract State -- Write
#+begin_src rust :tangle ../../examples/concordium_impls/src/concordium_impls.rs :eval never
  #[cfg_attr(feature = "creusot", logic)]
  pub fn write_impl_for_contract_state_test(current_position: ContractState, len: u32) -> bool {
      current_position.checked_add(len).is_none() // Check for overflow
  }

  #[cfg_attr(feature = "creusot", trusted)]
  pub fn write_impl_for_contract_state(
      current_position: ContractState,
      num_bytes: u32,
  ) -> (ContractState, usize) {
      (current_position + num_bytes, num_bytes as usize)
  }

#+end_src
**** Contract State -- Misc.
#+begin_src rust :tangle ../../examples/concordium_impls/src/concordium_impls.rs :eval never
  #[cfg_attr(feature = "creusot", logic)]
  pub fn has_contract_state_impl_for_contract_state_open() -> ContractState {
      0_u32
  }

  #[cfg_attr(feature = "creusot", logic)]
  pub fn has_contract_state_impl_for_contract_state_reserve_0(len: u32, cur_size: u32) -> bool {
      cur_size < len
  }
  #[cfg_attr(feature = "creusot", logic)]
  pub fn has_contract_state_impl_for_contract_state_reserve_1(res: u32) -> bool {
      res == 1_u32
  }

  #[cfg_attr(feature = "creusot", logic)]
  pub fn has_contract_state_impl_for_contract_state_truncate_0(cur_size: u32, new_size: u32) -> bool {
      cur_size > new_size
  }
  #[cfg_attr(feature = "creusot", logic)]
  pub fn has_contract_state_impl_for_contract_state_truncate_1(
      current_position: ContractState,
      new_size: u32,
  ) -> ContractState {
      if new_size < current_position {
	  new_size
      } else {
	  current_position
      }
  }

#+end_src
*** Parameter
#+begin_src rust :tangle ../../examples/concordium_impls/src/concordium_impls.rs :eval never
  pub type Parameter = u32;

  #[cfg_attr(feature = "creusot", trusted)]
  pub fn read_impl_for_parameter_read(
      current_position: Parameter,
      num_read: u32,
  ) -> (Parameter, usize) {
      (current_position + num_read, num_read as usize)
  }

#+end_src
