coq/src/concordium_impls.html
<li><a id="org9bd2d2c"></a>Contract State &#x2013; Write<br />
<div class="outline-text-5" id="text-1-3-2-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, logic</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">write_impl_for_contract_state_test</span><span style="color: #7d26cd;">(</span><span style="color: #9acd32;">current_position</span>: <span style="color: #00ff00;">ContractState</span>, <span style="color: #9acd32;">len</span>: <span style="color: #00ff00;">u32</span><span style="color: #7d26cd;">)</span> -&gt; <span style="color: #00ff00;">bool</span> <span style="color: #7d26cd;">{</span>
    current_position.checked_add<span style="color: #cd0000;">(</span>len<span style="color: #cd0000;">)</span>.is_none<span style="color: #cd0000;">()</span> <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Check for overflow</span>
<span style="color: #7d26cd;">}</span>

<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, trusted</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">write_impl_for_contract_state</span><span style="color: #7d26cd;">(</span>
    <span style="color: #9acd32;">current_position</span>: <span style="color: #00ff00;">ContractState</span>,
    <span style="color: #9acd32;">num_bytes</span>: <span style="color: #00ff00;">u32</span>,
<span style="color: #7d26cd;">)</span> -&gt; <span style="color: #7d26cd;">(</span><span style="color: #00ff00;">ContractState</span>, <span style="color: #00ff00;">usize</span><span style="color: #7d26cd;">)</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #cd0000;">(</span>current_position + num_bytes, num_bytes <span style="color: #b3b3b3;">as</span> <span style="color: #00ff00;">usize</span><span style="color: #cd0000;">)</span>
<span style="color: #7d26cd;">}</span>

</pre>
</div>
</div>
</li>
<li><a id="orgba0a818"></a>Contract State &#x2013; Misc.<br />
<div class="outline-text-5" id="text-1-3-2-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, logic</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">has_contract_state_impl_for_contract_state_open</span><span style="color: #7d26cd;">()</span> -&gt; <span style="color: #00ff00;">ContractState</span> <span style="color: #7d26cd;">{</span>
    0_u32
<span style="color: #7d26cd;">}</span>

<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, logic</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">has_contract_state_impl_for_contract_state_reserve_0</span><span style="color: #7d26cd;">(</span><span style="color: #9acd32;">len</span>: <span style="color: #00ff00;">u32</span>, <span style="color: #9acd32;">cur_size</span>: <span style="color: #00ff00;">u32</span><span style="color: #7d26cd;">)</span> -&gt; <span style="color: #00ff00;">bool</span> <span style="color: #7d26cd;">{</span>
    cur_size &lt; len
<span style="color: #7d26cd;">}</span>
<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, logic</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">has_contract_state_impl_for_contract_state_reserve_1</span><span style="color: #7d26cd;">(</span><span style="color: #9acd32;">res</span>: <span style="color: #00ff00;">u32</span><span style="color: #7d26cd;">)</span> -&gt; <span style="color: #00ff00;">bool</span> <span style="color: #7d26cd;">{</span>
    res == 1_u32
<span style="color: #7d26cd;">}</span>

<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, logic</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">has_contract_state_impl_for_contract_state_truncate_0</span><span style="color: #7d26cd;">(</span><span style="color: #9acd32;">cur_size</span>: <span style="color: #00ff00;">u32</span>, <span style="color: #9acd32;">new_size</span>: <span style="color: #00ff00;">u32</span><span style="color: #7d26cd;">)</span> -&gt; <span style="color: #00ff00;">bool</span> <span style="color: #7d26cd;">{</span>
    cur_size &gt; new_size
<span style="color: #7d26cd;">}</span>
<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, logic</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">has_contract_state_impl_for_contract_state_truncate_1</span><span style="color: #7d26cd;">(</span>
    <span style="color: #9acd32;">current_position</span>: <span style="color: #00ff00;">ContractState</span>,
    <span style="color: #9acd32;">new_size</span>: <span style="color: #00ff00;">u32</span>,
<span style="color: #7d26cd;">)</span> -&gt; <span style="color: #00ff00;">ContractState</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #b3b3b3;">if</span> new_size &lt; current_position <span style="color: #cd0000;">{</span>
        new_size
    <span style="color: #cd0000;">}</span> <span style="color: #b3b3b3;">else</span> <span style="color: #cd0000;">{</span>
        current_position
    <span style="color: #cd0000;">}</span>
<span style="color: #7d26cd;">}</span>

</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orged9fe39" class="outline-4">
<h4 id="orged9fe39"><span class="section-number-4">1.3.3.</span> Parameter</h4>
<div class="outline-text-4" id="text-1-3-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">type</span> <span style="color: #00ff00;">Parameter</span> = <span style="color: #00ff00;">u32</span>;

<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, trusted</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">read_impl_for_parameter_read</span><span style="color: #7d26cd;">(</span>
    <span style="color: #9acd32;">current_position</span>: <span style="color: #00ff00;">Parameter</span>,
    <span style="color: #9acd32;">num_read</span>: <span style="color: #00ff00;">u32</span>,
<span style="color: #7d26cd;">)</span> -&gt; <span style="color: #7d26cd;">(</span><span style="color: #00ff00;">Parameter</span>, <span style="color: #00ff00;">usize</span><span style="color: #7d26cd;">)</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #cd0000;">(</span>current_position + num_read, num_read <span style="color: #b3b3b3;">as</span> <span style="color: #00ff00;">usize</span><span style="color: #cd0000;">)</span>
<span style="color: #7d26cd;">}</span>

</pre>
</div>
</div>
</div>
