coq/src/concordium_impls.html
<div id="outline-container-orgd6c64f2" class="outline-4">
<h4 id="orgd6c64f2"><span class="section-number-4">1.3.4.</span> AttributesCursor</h4>
<div class="outline-text-4" id="text-1-3-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">pub struct AttributeTag(pub u8);</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">type</span> <span style="color: #00ff00;">AttributesCursor</span> = <span style="color: #7d26cd;">(</span><span style="color: #00ff00;">u32</span>, <span style="color: #00ff00;">u16</span><span style="color: #7d26cd;">)</span>;

<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, trusted</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">has_policy_impl_for_policy_attributes_cursor_next_test</span><span style="color: #7d26cd;">(</span>
    <span style="color: #9acd32;">policy_attribute_items</span>: <span style="color: #00ff00;">AttributesCursor</span>,
<span style="color: #7d26cd;">)</span> -&gt; <span style="color: #00ff00;">bool</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #b3b3b3;">let</span> <span style="color: #cd0000;">(</span>_, remaining_items<span style="color: #cd0000;">)</span> = policy_attribute_items;
    remaining_items == 0_u16
<span style="color: #7d26cd;">}</span>

<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, trusted</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">has_policy_impl_for_policy_attributes_cursor_next_tag_invalid</span><span style="color: #7d26cd;">(</span>
    <span style="color: #9acd32;">policy_attribute_items</span>: <span style="color: #00ff00;">AttributesCursor</span>,
    <span style="color: #9acd32;">tag_value_len_1</span>: <span style="color: #00ff00;">u8</span>,
    <span style="color: #9acd32;">num_read</span>: <span style="color: #00ff00;">u32</span>,
<span style="color: #7d26cd;">)</span> -&gt; <span style="color: #7d26cd;">(</span><span style="color: #00ff00;">AttributesCursor</span>, <span style="color: #00ff00;">bool</span><span style="color: #7d26cd;">)</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #b3b3b3;">let</span> <span style="color: #cd0000;">(</span>current_position, remaining_items<span style="color: #cd0000;">)</span> = policy_attribute_items;
    <span style="color: #b3b3b3;">let</span> <span style="color: #9acd32;">policy_attribute_items</span> = <span style="color: #cd0000;">(</span>current_position + num_read, remaining_items<span style="color: #cd0000;">)</span>;
    <span style="color: #cd0000;">(</span>policy_attribute_items, tag_value_len_1 &gt; 31_u8<span style="color: #cd0000;">)</span>
<span style="color: #7d26cd;">}</span>

<span style="color: #4169e1;">#</span><span style="color: #7d26cd;">[</span><span style="color: #4169e1;">cfg_attr</span><span style="color: #cd0000;">(</span><span style="color: #4169e1;">feature = </span><span style="color: #bdb76b;">"creusot"</span><span style="color: #4169e1;">, trusted</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">]</span>
<span style="color: #b3b3b3;">pub</span> <span style="color: #b3b3b3;">fn</span> <span style="color: #00ffff;">has_policy_impl_for_policy_attributes_cursor_next</span><span style="color: #7d26cd;">(</span>
    <span style="color: #9acd32;">policy_attribute_items</span>: <span style="color: #00ff00;">AttributesCursor</span>,
    <span style="color: #9acd32;">num_read</span>: <span style="color: #00ff00;">u32</span>,
<span style="color: #7d26cd;">)</span> -&gt; <span style="color: #00ff00;">AttributesCursor</span> <span style="color: #7d26cd;">{</span>
    <span style="color: #b3b3b3;">let</span> <span style="color: #cd0000;">(</span>current_position, remaining_items<span style="color: #cd0000;">)</span> = policy_attribute_items;
    <span style="color: #cd0000;">(</span>current_position + num_read, remaining_items - 1_u16<span style="color: #cd0000;">)</span>
<span style="color: #7d26cd;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbf4a7f1" class="outline-3">
<h3 id="orgbf4a7f1"><span class="section-number-3">1.4.</span> Rust Tests</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-rust">
</pre>
</div>
</div>
</div>

<div id="outline-container-orgadc6d21" class="outline-3">
<h3 id="orgadc6d21"><span class="section-number-3">1.5.</span> Resulting output</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-sh">cargo clean
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b0c4de;">cd</span> ../.. &amp;&amp; cargo install --path language
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b0c4de;">cd</span> ../.. &amp;&amp; cargo build
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">cargo hacspec -o ConcordiumImpls.v concordium_impls --init
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">cargo hacspec -o ConcordiumImpls.v concordium_impls --update
</pre>
</div>
</div>
</div>

<div id="outline-container-orgff24c33" class="outline-3">
<h3 id="orgff24c33"><span class="section-number-3">1.6.</span> Generation of backend output</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-org38ab639" class="outline-4">
<h4 id="org38ab639"><span class="section-number-4">1.6.1.</span> The includes</h4>
<div class="outline-text-4" id="text-1-6-1">
<div class="org-src-container">
<pre class="src src-coq"><span style="color: light orange;">(** This file was automatically generated using Hacspec **)</span>
<span style="color: #b3b3b3; text-decoration: underline;">Require Import</span> Lib MachineIntegers.
<span style="color: #b3b3b3;">From</span> Coq <span style="color: #b3b3b3; text-decoration: underline;">Require Import</span> ZArith.
<span style="color: #b3b3b3;">Import</span> List.ListNotations.
<span style="color: #b3b3b3;">Open Scope</span> Z_scope.
<span style="color: #b3b3b3;">Open Scope</span> bool_scope.
<span style="color: #b3b3b3;">Open Scope</span> hacspec_scope.
<span style="color: #b3b3b3; text-decoration: underline;">Require Import</span> Hacspec.Lib.

</pre>
</div>
</div>
</div>

<div id="outline-container-org427d530" class="outline-4">
<h4 id="org427d530"><span class="section-number-4">1.6.2.</span> Types and default implementations</h4>
<div class="outline-text-4" id="text-1-6-2">
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #b3b3b3;">Notation</span> <span style="color: #bdb76b;">"'reject'"</span> := <span style="color: #7d26cd;">(</span>int32<span style="color: #7d26cd;">)</span> : hacspec_scope.

</pre>
</div>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">reject_impl_deafult</span>  : reject :=
  min.

</pre>
</div>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #b3b3b3;">Notation</span> <span style="color: #bdb76b;">"'option_reject'"</span> := <span style="color: #7d26cd;">(</span><span style="color: #cd0000;">(</span>option reject<span style="color: #cd0000;">)</span><span style="color: #7d26cd;">)</span> : hacspec_scope.

</pre>
</div>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">new_reject_impl</span> <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">x_0</span> : int32<span style="color: #7d26cd;">)</span> : option_reject :=
  <span style="color: #7d26cd;">(</span><span style="color: #00ff00;">if</span> <span style="color: #cd0000;">(</span><span style="color: #cd8500;">(</span>x_0<span style="color: #cd8500;">)</span> &lt;.? <span style="color: #cd8500;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 0<span style="color: #cd8500;">)</span><span style="color: #cd0000;">)</span>:bool <span style="color: #00ff00;">then</span> <span style="color: #cd0000;">(</span><span style="color: #87ceeb;">@</span>Some reject <span style="color: #cd8500;">(</span>x_0<span style="color: #cd8500;">)</span><span style="color: #cd0000;">)</span> <span style="color: #00ff00;">else</span> <span style="color: #cd0000;">(</span>
      <span style="color: #87ceeb;">@</span>None int32<span style="color: #cd0000;">)</span><span style="color: #7d26cd;">)</span>.

</pre>
</div>
</div>
</div>
