coq/src/concordium_impls.html

<div id="outline-container-orga7ee377" class="outline-4">
<h4 id="orga7ee377"><span class="section-number-4">1.6.3.</span> Error handling</h4>
<div class="outline-text-4" id="text-1-6-3">
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">reject_impl_convert_from_unit</span>  : reject :=
  <span style="color: #7d26cd;">(</span>min<span style="color: #7d26cd;">)</span> .+ <span style="color: #7d26cd;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 1<span style="color: #7d26cd;">)</span>.

<span style="color: #b3b3b3;">Theorem</span> <span style="color: #00ffff;">ensures_reject_impl_convert_from_unit</span> : <span style="color: #00ff00;">forall</span> <span style="color: #9acd32;">result_1</span> ,
<span style="color: #87ceeb;">@</span>reject_impl_convert_from_unit  = result_1 -&gt;
<span style="color: #7d26cd;">(</span>result_1<span style="color: #7d26cd;">)</span> !=.? <span style="color: #7d26cd;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 0<span style="color: #7d26cd;">)</span>.
<span style="color: #b3b3b3;">Proof</span>. 
  <span style="color: #9370db;">intros</span> ; <span style="color: #9370db;">subst</span>.
  <span style="color: #ff0000;">reflexivity</span>.
<span style="color: #b3b3b3;">Qed</span>.


</pre>
</div>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">reject_impl_convert_from_parse_error</span>  : reject :=
  <span style="color: #7d26cd;">(</span>min<span style="color: #7d26cd;">)</span> .+ <span style="color: #7d26cd;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 2<span style="color: #7d26cd;">)</span>.

<span style="color: #b3b3b3;">Theorem</span> <span style="color: #00ffff;">ensures_reject_impl_convert_from_parse_error</span> : <span style="color: #00ff00;">forall</span> <span style="color: #9acd32;">result_1</span> ,
<span style="color: #87ceeb;">@</span>reject_impl_convert_from_parse_error  = result_1 -&gt;
<span style="color: #7d26cd;">(</span>result_1<span style="color: #7d26cd;">)</span> !=.? <span style="color: #7d26cd;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 0<span style="color: #7d26cd;">)</span>.
<span style="color: #b3b3b3;">Proof</span>. 
  <span style="color: #9370db;">intros</span> ; <span style="color: #9370db;">subst</span>.
  <span style="color: #ff0000;">reflexivity</span>.
<span style="color: #b3b3b3;">Qed</span>.

</pre>
</div>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #b3b3b3;">Inductive</span> <span style="color: #00ffff;">log_error</span> :=
| Full : log_error
| Malformed : log_error.

<span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">reject_impl_from_log_error</span> <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">le_2</span> : log_error<span style="color: #7d26cd;">)</span> : reject :=
  <span style="color: #00ff00;">match</span> le_2 <span style="color: #00ff00;">with</span>
  | Full =&gt; <span style="color: #7d26cd;">(</span>min<span style="color: #7d26cd;">)</span> .+ <span style="color: #7d26cd;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 3<span style="color: #7d26cd;">)</span>
  | Malformed =&gt; <span style="color: #7d26cd;">(</span>min<span style="color: #7d26cd;">)</span> .+ <span style="color: #7d26cd;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 4<span style="color: #7d26cd;">)</span>
  <span style="color: #00ff00;">end</span>.

<span style="color: #b3b3b3;">Theorem</span> <span style="color: #00ffff;">ensures_reject_impl_from_log_error</span> : <span style="color: #00ff00;">forall</span> result_1 <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">le_2</span> : log_error<span style="color: #7d26cd;">)</span>,
<span style="color: #87ceeb;">@</span>reject_impl_from_log_error le_2 = result_1 -&gt;
<span style="color: #7d26cd;">(</span>result_1<span style="color: #7d26cd;">)</span> !=.? <span style="color: #7d26cd;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 0<span style="color: #7d26cd;">)</span>.
<span style="color: #b3b3b3;">Proof</span>.  
  <span style="color: #9370db;">intros</span> ; <span style="color: #9370db;">subst</span>.
  <span style="color: #9370db;">destruct</span> le_2 ; <span style="color: #ff0000;">reflexivity</span>.
<span style="color: #b3b3b3;">Qed</span>.

</pre>
</div>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #b3b3b3;">Inductive</span> <span style="color: #00ffff;">new_contract_name_error</span> :=
| NewContractNameErrorMissingInitPrefix : new_contract_name_error
| NewContractNameErrorTooLong : new_contract_name_error
| NewContractNameErrorContainsDot : new_contract_name_error
| NewContractNameErrorInvalidCharacters : new_contract_name_error.

<span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">reject_impl_from_new_contract_name_error</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">nre_3</span> : new_contract_name_error<span style="color: #7d26cd;">)</span>
  : reject :=
  <span style="color: #00ff00;">match</span> nre_3 <span style="color: #00ff00;">with</span>
  | NewContractNameErrorMissingInitPrefix =&gt; <span style="color: #7d26cd;">(</span>min<span style="color: #7d26cd;">)</span> .+ <span style="color: #7d26cd;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 5<span style="color: #7d26cd;">)</span>
  | NewContractNameErrorTooLong =&gt; <span style="color: #7d26cd;">(</span>min<span style="color: #7d26cd;">)</span> .+ <span style="color: #7d26cd;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 6<span style="color: #7d26cd;">)</span>
  | NewContractNameErrorContainsDot =&gt; <span style="color: #7d26cd;">(</span>min<span style="color: #7d26cd;">)</span> .+ <span style="color: #7d26cd;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 9<span style="color: #7d26cd;">)</span>
  | NewContractNameErrorInvalidCharacters =&gt; <span style="color: #7d26cd;">(</span>min<span style="color: #7d26cd;">)</span> .+ <span style="color: #7d26cd;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 10<span style="color: #7d26cd;">)</span>
  <span style="color: #00ff00;">end</span>.

<span style="color: #b3b3b3;">Theorem</span> <span style="color: #00ffff;">ensures_reject_impl_from_new_contract_name_error</span> : <span style="color: #00ff00;">forall</span> result_1 <span style="color: #7d26cd;">(</span>
  <span style="color: #9acd32;">nre_3</span> : new_contract_name_error<span style="color: #7d26cd;">)</span>,
<span style="color: #87ceeb;">@</span>reject_impl_from_new_contract_name_error nre_3 = result_1 -&gt;
<span style="color: #7d26cd;">(</span>result_1<span style="color: #7d26cd;">)</span> !=.? <span style="color: #7d26cd;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 0<span style="color: #7d26cd;">)</span>.
<span style="color: #b3b3b3;">Proof</span>. 
  <span style="color: #9370db;">intros</span> ; <span style="color: #9370db;">subst</span>.
  <span style="color: #9370db;">destruct</span> nre_3 ; <span style="color: #ff0000;">reflexivity</span>.
<span style="color: #b3b3b3;">Qed</span>.

</pre>
</div>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #b3b3b3;">Inductive</span> <span style="color: #00ffff;">new_receive_name_error</span> :=
| NewReceiveNameErrorMissingDotSeparator : new_receive_name_error
| NewReceiveNameErrorTooLong : new_receive_name_error
| NewReceiveNameErrorInvalidCharacters : new_receive_name_error.

<span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">reject_impl_from_new_receive_name_error</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">nre_4</span> : new_receive_name_error<span style="color: #7d26cd;">)</span>
  : reject :=
  <span style="color: #00ff00;">match</span> nre_4 <span style="color: #00ff00;">with</span>
  | NewReceiveNameErrorMissingDotSeparator =&gt; <span style="color: #7d26cd;">(</span>min<span style="color: #7d26cd;">)</span> .+ <span style="color: #7d26cd;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 7<span style="color: #7d26cd;">)</span>
  | NewReceiveNameErrorTooLong =&gt; <span style="color: #7d26cd;">(</span>min<span style="color: #7d26cd;">)</span> .+ <span style="color: #7d26cd;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 8<span style="color: #7d26cd;">)</span>
  | NewReceiveNameErrorInvalidCharacters =&gt; <span style="color: #7d26cd;">(</span>min<span style="color: #7d26cd;">)</span> .+ <span style="color: #7d26cd;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 11<span style="color: #7d26cd;">)</span>
  <span style="color: #00ff00;">end</span>.

<span style="color: #b3b3b3;">Theorem</span> <span style="color: #00ffff;">ensures_reject_impl_from_new_receive_name_error</span> : <span style="color: #00ff00;">forall</span> result_1 <span style="color: #7d26cd;">(</span>
  <span style="color: #9acd32;">nre_4</span> : new_receive_name_error<span style="color: #7d26cd;">)</span>,
<span style="color: #87ceeb;">@</span>reject_impl_from_new_receive_name_error nre_4 = result_1 -&gt;
<span style="color: #7d26cd;">(</span>result_1<span style="color: #7d26cd;">)</span> !=.? <span style="color: #7d26cd;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 0<span style="color: #7d26cd;">)</span>.
<span style="color: #b3b3b3;">Proof</span>.
  <span style="color: #9370db;">intros</span> ; <span style="color: #9370db;">subst</span>.
  <span style="color: #9370db;">destruct</span> nre_4 ; <span style="color: #ff0000;">reflexivity</span>.
<span style="color: #b3b3b3;">Qed</span>.

</pre>
</div>
</div>
</div>
