coq/src/concordium_impls.org
*** Contract state
#+NAME: linum10
#+CALL: next(ARG="0 2", linum=linum9) :exports none
#+NAME: seg10
#+CALL: split-file(ARG=linum10) :eval
#+RESULTS: seg10
#+begin_src coq :tangle ConcordiumImpls.v :results output silent
Notation "'contract_state'" := (int32) : hacspec_scope.

#+end_src

#+NAME: linum11
#+CALL: next(ARG="0 4", linum=linum10) :exports none
#+NAME: seg11
#+CALL: split-file(ARG=linum11) :eval
#+RESULTS: seg11
#+begin_src coq :tangle ConcordiumImpls.v :results output silent
Notation "'seek_result'" := ((result (contract_state × int64
  ) unit)) : hacspec_scope.

Inductive seek_from :=
| Start : int64 -> seek_from
| End : int64 -> seek_from
| Current : int64 -> seek_from.

#+end_src

#+NAME: linum12
#+CALL: next(ARG="0 4", linum=linum11) :exports none
#+NAME: seg12
#+CALL: split-file(ARG=linum12) :eval
#+RESULTS: seg12
#+begin_src coq :tangle ConcordiumImpls.v :results output silent
Notation "'uint32_option'" := ((option int32)) : hacspec_scope.

Notation "'iint64_option'" := ((option int64)) : hacspec_scope.

#+end_src

#+NAME: linum13
#+CALL: next(ARG="0 2", linum=linum12) :exports none
#+NAME: seg13
#+CALL: split-file(ARG=linum13) :eval
#+RESULTS: seg13
#+begin_src coq :tangle ConcordiumImpls.v :results output silent
Definition contract_state_impl_seek
  (current_position_5 : contract_state)
  (pos_6 : seek_from)
  `{forall delta_7 : int64,
  pos_6 = End (delta_7) ->
  exists b_8 : int32,
  (pub_uint32_checked_add (current_position_5) (@cast _ uint32 _ (
        delta_7))) =.? (@Some int32 (b_8))}
  : seek_result :=
  match pos_6 with
  | Start offset_9 => @Ok (contract_state × int64) unit ((
      @cast _ uint32 _ (offset_9),
      offset_9
    ))
  | End delta_10 => (if ((delta_10) >=.? (@repr WORDSIZE64 0)):bool then (
      match pub_uint32_checked_add (current_position_5) (@cast _ uint32 _ (
          delta_10)) with
      | Some b_11 => @Ok (contract_state × int64) unit ((
          b_11,
          @cast _ uint64 _ (delta_10)
        ))
      | None => @Err (contract_state × int64) unit (tt)
      end) else (match pub_int64_checked_abs (delta_10) with
      | Some b_12 => @Ok (contract_state × int64) unit ((
          (@repr WORDSIZE32 4) .- (@cast _ uint32 _ (b_12)),
          @cast _ uint64 _ ((@repr WORDSIZE32 4) .- (@cast _ uint32 _ (b_12)))
        ))
      | None => @Err (contract_state × int64) unit (tt)
      end))
  | Current delta_13 => (if ((delta_13) >=.? (@repr WORDSIZE64 0)):bool then (
      match pub_uint32_checked_add (current_position_5) (@cast _ uint32 _ (
          delta_13)) with
      | Some offset_14 => @Ok (contract_state × int64) unit ((
          offset_14,
          @cast _ uint64 _ (offset_14)
        ))
      | None => @Err (contract_state × int64) unit (tt)
      end) else (match pub_int64_checked_abs (delta_13) with
      | Some b_15 => match pub_uint32_checked_sub (current_position_5) (
        @cast _ uint32 _ (b_15)) with
      | Some offset_16 => @Ok (contract_state × int64) unit ((
          offset_16,
          @cast _ uint64 _ (offset_16)
        ))
      | None => @Err (contract_state × int64) unit (tt)
      end
      | None => @Err (contract_state × int64) unit (tt)
      end))
  end.

#+end_src

