coq/src/concordium_impls.html

<div id="outline-container-org460e005" class="outline-4">
<h4 id="org460e005"><span class="section-number-4">1.6.4.</span> Contract state</h4>
<div class="outline-text-4" id="text-1-6-4">
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #b3b3b3;">Notation</span> <span style="color: #bdb76b;">"'contract_state'"</span> := <span style="color: #7d26cd;">(</span>int32<span style="color: #7d26cd;">)</span> : hacspec_scope.

</pre>
</div>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #b3b3b3;">Notation</span> <span style="color: #bdb76b;">"'seek_result'"</span> := <span style="color: #7d26cd;">(</span><span style="color: #cd0000;">(</span>result <span style="color: #cd8500;">(</span>contract_state &#215; int64
  <span style="color: #cd8500;">)</span> unit<span style="color: #cd0000;">)</span><span style="color: #7d26cd;">)</span> : hacspec_scope.

<span style="color: #b3b3b3;">Inductive</span> <span style="color: #00ffff;">seek_from</span> :=
| Start : int64 -&gt; seek_from
| <span style="color: #b3b3b3;">End</span> : int64 -&gt; seek_from
| Current : int64 -&gt; seek_from.

</pre>
</div>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #b3b3b3;">Notation</span> <span style="color: #bdb76b;">"'uint32_option'"</span> := <span style="color: #7d26cd;">(</span><span style="color: #cd0000;">(</span>option int32<span style="color: #cd0000;">)</span><span style="color: #7d26cd;">)</span> : hacspec_scope.

<span style="color: #b3b3b3;">Notation</span> <span style="color: #bdb76b;">"'iint64_option'"</span> := <span style="color: #7d26cd;">(</span><span style="color: #cd0000;">(</span>option int64<span style="color: #cd0000;">)</span><span style="color: #7d26cd;">)</span> : hacspec_scope.

</pre>
</div>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">contract_state_impl_seek</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">current_position_5</span> : contract_state<span style="color: #7d26cd;">)</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">pos_6</span> : seek_from<span style="color: #7d26cd;">)</span>
  `<span style="color: #7d26cd;">{</span><span style="color: #00ff00;">forall</span> <span style="color: #9acd32;">delta_7</span> : int64,
  pos_6 = <span style="color: #b3b3b3;">End</span> <span style="color: #cd0000;">(</span>delta_7<span style="color: #cd0000;">)</span> -&gt;
  <span style="color: #9370db;">exists</span> <span style="color: #9acd32;">b_8</span> : int32,
  <span style="color: #cd0000;">(</span>pub_uint32_checked_add <span style="color: #cd8500;">(</span>current_position_5<span style="color: #cd8500;">)</span> <span style="color: #cd8500;">(</span><span style="color: #87ceeb;">@</span>cast _ uint32 _ <span style="color: #cdcd00;">(</span>
        delta_7<span style="color: #cdcd00;">)</span><span style="color: #cd8500;">)</span><span style="color: #cd0000;">)</span> =.? <span style="color: #cd0000;">(</span><span style="color: #87ceeb;">@</span>Some int32 <span style="color: #cd8500;">(</span>b_8<span style="color: #cd8500;">)</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">}</span>
  : seek_result :=
  <span style="color: #00ff00;">match</span> pos_6 <span style="color: #00ff00;">with</span>
  | Start offset_9 =&gt; <span style="color: #87ceeb;">@</span>Ok <span style="color: #7d26cd;">(</span>contract_state &#215; int64<span style="color: #7d26cd;">)</span> unit <span style="color: #7d26cd;">(</span><span style="color: #cd0000;">(</span>
      <span style="color: #87ceeb;">@</span>cast _ uint32 _ <span style="color: #cd8500;">(</span>offset_9<span style="color: #cd8500;">)</span>,
      offset_9
    <span style="color: #cd0000;">)</span><span style="color: #7d26cd;">)</span>
  | <span style="color: #b3b3b3;">End</span> delta_10 =&gt; <span style="color: #7d26cd;">(</span><span style="color: #00ff00;">if</span> <span style="color: #cd0000;">(</span><span style="color: #cd8500;">(</span>delta_10<span style="color: #cd8500;">)</span> &gt;=.? <span style="color: #cd8500;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE64 0<span style="color: #cd8500;">)</span><span style="color: #cd0000;">)</span>:bool <span style="color: #00ff00;">then</span> <span style="color: #cd0000;">(</span>
      <span style="color: #00ff00;">match</span> pub_uint32_checked_add <span style="color: #cd8500;">(</span>current_position_5<span style="color: #cd8500;">)</span> <span style="color: #cd8500;">(</span><span style="color: #87ceeb;">@</span>cast _ uint32 _ <span style="color: #cdcd00;">(</span>
          delta_10<span style="color: #cdcd00;">)</span><span style="color: #cd8500;">)</span> <span style="color: #00ff00;">with</span>
      | Some b_11 =&gt; <span style="color: #87ceeb;">@</span>Ok <span style="color: #cd8500;">(</span>contract_state &#215; int64<span style="color: #cd8500;">)</span> unit <span style="color: #cd8500;">(</span><span style="color: #cdcd00;">(</span>
          b_11,
          <span style="color: #87ceeb;">@</span>cast _ uint64 _ <span style="color: #00cd00;">(</span>delta_10<span style="color: #00cd00;">)</span>
        <span style="color: #cdcd00;">)</span><span style="color: #cd8500;">)</span>
      | None =&gt; <span style="color: #87ceeb;">@</span>Err <span style="color: #cd8500;">(</span>contract_state &#215; int64<span style="color: #cd8500;">)</span> unit <span style="color: #cd8500;">(</span>tt<span style="color: #cd8500;">)</span>
      <span style="color: #00ff00;">end</span><span style="color: #cd0000;">)</span> <span style="color: #00ff00;">else</span> <span style="color: #cd0000;">(</span><span style="color: #00ff00;">match</span> pub_int64_checked_abs <span style="color: #cd8500;">(</span>delta_10<span style="color: #cd8500;">)</span> <span style="color: #00ff00;">with</span>
      | Some b_12 =&gt; <span style="color: #87ceeb;">@</span>Ok <span style="color: #cd8500;">(</span>contract_state &#215; int64<span style="color: #cd8500;">)</span> unit <span style="color: #cd8500;">(</span><span style="color: #cdcd00;">(</span>
          <span style="color: #00cd00;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 4<span style="color: #00cd00;">)</span> .- <span style="color: #00cd00;">(</span><span style="color: #87ceeb;">@</span>cast _ uint32 _ <span style="color: #00cdcd;">(</span>b_12<span style="color: #00cdcd;">)</span><span style="color: #00cd00;">)</span>,
          <span style="color: #87ceeb;">@</span>cast _ uint64 _ <span style="color: #00cd00;">(</span><span style="color: #00cdcd;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 4<span style="color: #00cdcd;">)</span> .- <span style="color: #00cdcd;">(</span><span style="color: #87ceeb;">@</span>cast _ uint32 _ <span style="color: #0000cd;">(</span>b_12<span style="color: #0000cd;">)</span><span style="color: #00cdcd;">)</span><span style="color: #00cd00;">)</span>
        <span style="color: #cdcd00;">)</span><span style="color: #cd8500;">)</span>
      | None =&gt; <span style="color: #87ceeb;">@</span>Err <span style="color: #cd8500;">(</span>contract_state &#215; int64<span style="color: #cd8500;">)</span> unit <span style="color: #cd8500;">(</span>tt<span style="color: #cd8500;">)</span>
      <span style="color: #00ff00;">end</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">)</span>
  | Current delta_13 =&gt; <span style="color: #7d26cd;">(</span><span style="color: #00ff00;">if</span> <span style="color: #cd0000;">(</span><span style="color: #cd8500;">(</span>delta_13<span style="color: #cd8500;">)</span> &gt;=.? <span style="color: #cd8500;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE64 0<span style="color: #cd8500;">)</span><span style="color: #cd0000;">)</span>:bool <span style="color: #00ff00;">then</span> <span style="color: #cd0000;">(</span>
      <span style="color: #00ff00;">match</span> pub_uint32_checked_add <span style="color: #cd8500;">(</span>current_position_5<span style="color: #cd8500;">)</span> <span style="color: #cd8500;">(</span><span style="color: #87ceeb;">@</span>cast _ uint32 _ <span style="color: #cdcd00;">(</span>
          delta_13<span style="color: #cdcd00;">)</span><span style="color: #cd8500;">)</span> <span style="color: #00ff00;">with</span>
      | Some offset_14 =&gt; <span style="color: #87ceeb;">@</span>Ok <span style="color: #cd8500;">(</span>contract_state &#215; int64<span style="color: #cd8500;">)</span> unit <span style="color: #cd8500;">(</span><span style="color: #cdcd00;">(</span>
          offset_14,
          <span style="color: #87ceeb;">@</span>cast _ uint64 _ <span style="color: #00cd00;">(</span>offset_14<span style="color: #00cd00;">)</span>
        <span style="color: #cdcd00;">)</span><span style="color: #cd8500;">)</span>
      | None =&gt; <span style="color: #87ceeb;">@</span>Err <span style="color: #cd8500;">(</span>contract_state &#215; int64<span style="color: #cd8500;">)</span> unit <span style="color: #cd8500;">(</span>tt<span style="color: #cd8500;">)</span>
      <span style="color: #00ff00;">end</span><span style="color: #cd0000;">)</span> <span style="color: #00ff00;">else</span> <span style="color: #cd0000;">(</span><span style="color: #00ff00;">match</span> pub_int64_checked_abs <span style="color: #cd8500;">(</span>delta_13<span style="color: #cd8500;">)</span> <span style="color: #00ff00;">with</span>
      | Some b_15 =&gt; <span style="color: #00ff00;">match</span> pub_uint32_checked_sub <span style="color: #cd8500;">(</span>current_position_5<span style="color: #cd8500;">)</span> <span style="color: #cd8500;">(</span>
        <span style="color: #87ceeb;">@</span>cast _ uint32 _ <span style="color: #cdcd00;">(</span>b_15<span style="color: #cdcd00;">)</span><span style="color: #cd8500;">)</span> <span style="color: #00ff00;">with</span>
      | Some offset_16 =&gt; <span style="color: #87ceeb;">@</span>Ok <span style="color: #cd8500;">(</span>contract_state &#215; int64<span style="color: #cd8500;">)</span> unit <span style="color: #cd8500;">(</span><span style="color: #cdcd00;">(</span>
          offset_16,
          <span style="color: #87ceeb;">@</span>cast _ uint64 _ <span style="color: #00cd00;">(</span>offset_16<span style="color: #00cd00;">)</span>
        <span style="color: #cdcd00;">)</span><span style="color: #cd8500;">)</span>
      | None =&gt; <span style="color: #87ceeb;">@</span>Err <span style="color: #cd8500;">(</span>contract_state &#215; int64<span style="color: #cd8500;">)</span> unit <span style="color: #cd8500;">(</span>tt<span style="color: #cd8500;">)</span>
      <span style="color: #00ff00;">end</span>
      | None =&gt; <span style="color: #87ceeb;">@</span>Err <span style="color: #cd8500;">(</span>contract_state &#215; int64<span style="color: #cd8500;">)</span> unit <span style="color: #cd8500;">(</span>tt<span style="color: #cd8500;">)</span>
      <span style="color: #00ff00;">end</span><span style="color: #cd0000;">)</span><span style="color: #7d26cd;">)</span>
  <span style="color: #00ff00;">end</span>.

</pre>
</div>
</div>

<ol class="org-ol">
