coq/src/concordium_impls.org
**** Contract state - Read Trait
#+NAME: linum14
#+CALL: next(ARG="0 5", linum=linum13) :exports none
#+NAME: seg14
#+CALL: split-file(ARG=linum14) :eval
#+RESULTS: seg14
#+begin_src coq :tangle ConcordiumImpls.v :results output silent
Definition load_state_hacspec
  (buf_17 : public_byte_seq)
  (offset_18 : int32)
  : (public_byte_seq × int32) :=
  (buf_17, @repr WORDSIZE32 1).

Theorem ensures_load_state_hacspec : forall result_1 (
  buf_17 : public_byte_seq) (offset_18 : int32),
@load_state_hacspec buf_17 offset_18 = result_1 ->
(result_1) !=.? ((buf_17, @repr WORDSIZE32 2)).
Proof.
  intros ; subst.
  unfold negb.
  cbn.
  rewrite list_eqdec_refl.
  cbn.
  rewrite (@eq_false WORDSIZE32 (repr 1) (repr 2)) ; easy.
Qed.  

#+end_src

#+NAME: linum15
#+CALL: next(ARG="0 8", linum=linum14) :exports none
#+NAME: seg15
#+CALL: split-file(ARG=linum15) :eval
#+RESULTS: seg15
#+begin_src coq :tangle ConcordiumImpls.v :results output silent
Definition contract_state_impl_read_read
  (current_position_19 : contract_state)
  (buf_20 : public_byte_seq)
  : (contract_state × uint_size) :=
  let '(buf_21, num_read_22) :=
    load_state_hacspec (buf_20) (current_position_19) in 
  ((current_position_19) .+ (num_read_22), @cast _ uint32 _ (num_read_22)).

Definition contract_state_impl_read_read_u64
  (current_position_23 : contract_state)
  (num_read_24 : int32)
  : (contract_state × bool) :=
  (
    (current_position_23) .+ (num_read_24),
    (num_read_24) =.? (@repr WORDSIZE32 8)
  ).

Definition contract_state_impl_read_read_u32
  (current_position_25 : contract_state)
  (num_read_26 : int32)
  : (contract_state × bool) :=
  (
    (current_position_25) .+ (num_read_26),
    (num_read_26) =.? (@repr WORDSIZE32 4)
  ).

Definition contract_state_impl_read_read_u8
  (current_position_27 : contract_state)
  (num_read_28 : int32)
  : (contract_state × bool) :=
  (
    (current_position_27) .+ (num_read_28),
    (num_read_28) =.? (@repr WORDSIZE32 1)
  ).

#+end_src

**** Contract state - Write Trait
#+NAME: linum16
#+CALL: next(ARG="0 4", linum=linum15) :exports none
#+NAME: seg16
#+CALL: split-file(ARG=linum16) :eval
#+RESULTS: seg16
#+begin_src coq :tangle ConcordiumImpls.v :results output silent
Definition write_impl_for_contract_state_test
  (current_position_29 : contract_state)
  (len_30 : int32)
  : bool :=
  option_is_none (pub_uint32_checked_add (current_position_29) (len_30)).

Definition write_impl_for_contract_state
  (current_position_31 : contract_state)
  (num_bytes_32 : int32)
  : (contract_state × uint_size) :=
  ((current_position_31) .+ (num_bytes_32), @cast _ uint32 _ (num_bytes_32)).

#+end_src

**** Contract State - Misc.
#+NAME: linum17
#+CALL: next(ARG="0 10", linum=linum16) :exports none
#+NAME: seg17
#+CALL: split-file(ARG=linum17) :eval
#+RESULTS: seg17
#+begin_src coq :tangle ConcordiumImpls.v :results output silent
Definition has_contract_state_impl_for_contract_state_open  : contract_state :=
  @repr WORDSIZE32 0.

Definition has_contract_state_impl_for_contract_state_reserve_0
  (len_33 : int32)
  (cur_size_34 : int32)
  : bool :=
  (cur_size_34) <.? (len_33).

Definition has_contract_state_impl_for_contract_state_reserve_1
  (res_35 : int32)
  : bool :=
  (res_35) =.? (@repr WORDSIZE32 1).

Definition has_contract_state_impl_for_contract_state_truncate_0
  (cur_size_36 : int32)
  (new_size_37 : int32)
  : bool :=
  (cur_size_36) >.? (new_size_37).

Definition has_contract_state_impl_for_contract_state_truncate_1
  (current_position_38 : contract_state)
  (new_size_39 : int32)
  : contract_state :=
  (if ((new_size_39) <.? (current_position_38)):bool then (new_size_39) else (
      current_position_38)).

#+end_src

