coq/src/concordium_impls.html
<li><a id="org20983d5"></a>Contract state - Read Trait<br />
<div class="outline-text-5" id="text-1-6-4-1">
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">load_state_hacspec</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">buf_17</span> : public_byte_seq<span style="color: #7d26cd;">)</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">offset_18</span> : int32<span style="color: #7d26cd;">)</span>
  : <span style="color: #7d26cd;">(</span>public_byte_seq &#215; int32<span style="color: #7d26cd;">)</span> :=
  <span style="color: #7d26cd;">(</span>buf_17, <span style="color: #87ceeb;">@</span>repr WORDSIZE32 1<span style="color: #7d26cd;">)</span>.

<span style="color: #b3b3b3;">Theorem</span> <span style="color: #00ffff;">ensures_load_state_hacspec</span> : <span style="color: #00ff00;">forall</span> result_1 <span style="color: #7d26cd;">(</span>
  <span style="color: #9acd32;">buf_17</span> : public_byte_seq<span style="color: #7d26cd;">)</span> <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">offset_18</span> : int32<span style="color: #7d26cd;">)</span>,
<span style="color: #87ceeb;">@</span>load_state_hacspec buf_17 offset_18 = result_1 -&gt;
<span style="color: #7d26cd;">(</span>result_1<span style="color: #7d26cd;">)</span> !=.? <span style="color: #7d26cd;">(</span><span style="color: #cd0000;">(</span>buf_17, <span style="color: #87ceeb;">@</span>repr WORDSIZE32 2<span style="color: #cd0000;">)</span><span style="color: #7d26cd;">)</span>.
<span style="color: #b3b3b3;">Proof</span>.
  <span style="color: #9370db;">intros</span> ; <span style="color: #9370db;">subst</span>.
  <span style="color: #9370db;">unfold</span> negb.
  <span style="color: #9370db;">cbn</span>.
  <span style="color: #9370db;">rewrite</span> list_eqdec_refl.
  <span style="color: #9370db;">cbn</span>.
  <span style="color: #9370db;">rewrite</span> <span style="color: #7d26cd;">(</span><span style="color: #87ceeb;">@</span>eq_false WORDSIZE32 <span style="color: #cd0000;">(</span>repr 1<span style="color: #cd0000;">)</span> <span style="color: #cd0000;">(</span>repr 2<span style="color: #cd0000;">)</span><span style="color: #7d26cd;">)</span> ; <span style="color: #ff0000;">easy</span>.
<span style="color: #b3b3b3;">Qed</span>.  

</pre>
</div>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">contract_state_impl_read_read</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">current_position_19</span> : contract_state<span style="color: #7d26cd;">)</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">buf_20</span> : public_byte_seq<span style="color: #7d26cd;">)</span>
  : <span style="color: #7d26cd;">(</span>contract_state &#215; uint_size<span style="color: #7d26cd;">)</span> :=
  <span style="color: #00ff00;">let</span> '<span style="color: #7d26cd;">(</span>buf_21, num_read_22<span style="color: #7d26cd;">)</span> :=
    load_state_hacspec <span style="color: #7d26cd;">(</span>buf_20<span style="color: #7d26cd;">)</span> <span style="color: #7d26cd;">(</span>current_position_19<span style="color: #7d26cd;">)</span> <span style="color: #00ff00;">in</span> 
  <span style="color: #7d26cd;">(</span><span style="color: #cd0000;">(</span>current_position_19<span style="color: #cd0000;">)</span> .+ <span style="color: #cd0000;">(</span>num_read_22<span style="color: #cd0000;">)</span>, <span style="color: #87ceeb;">@</span>cast _ uint32 _ <span style="color: #cd0000;">(</span>num_read_22<span style="color: #cd0000;">)</span><span style="color: #7d26cd;">)</span>.

<span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">contract_state_impl_read_read_u64</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">current_position_23</span> : contract_state<span style="color: #7d26cd;">)</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">num_read_24</span> : int32<span style="color: #7d26cd;">)</span>
  : <span style="color: #7d26cd;">(</span>contract_state &#215; bool<span style="color: #7d26cd;">)</span> :=
  <span style="color: #7d26cd;">(</span>
    <span style="color: #cd0000;">(</span>current_position_23<span style="color: #cd0000;">)</span> .+ <span style="color: #cd0000;">(</span>num_read_24<span style="color: #cd0000;">)</span>,
    <span style="color: #cd0000;">(</span>num_read_24<span style="color: #cd0000;">)</span> =.? <span style="color: #cd0000;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 8<span style="color: #cd0000;">)</span>
  <span style="color: #7d26cd;">)</span>.

<span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">contract_state_impl_read_read_u32</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">current_position_25</span> : contract_state<span style="color: #7d26cd;">)</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">num_read_26</span> : int32<span style="color: #7d26cd;">)</span>
  : <span style="color: #7d26cd;">(</span>contract_state &#215; bool<span style="color: #7d26cd;">)</span> :=
  <span style="color: #7d26cd;">(</span>
    <span style="color: #cd0000;">(</span>current_position_25<span style="color: #cd0000;">)</span> .+ <span style="color: #cd0000;">(</span>num_read_26<span style="color: #cd0000;">)</span>,
    <span style="color: #cd0000;">(</span>num_read_26<span style="color: #cd0000;">)</span> =.? <span style="color: #cd0000;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 4<span style="color: #cd0000;">)</span>
  <span style="color: #7d26cd;">)</span>.

<span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">contract_state_impl_read_read_u8</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">current_position_27</span> : contract_state<span style="color: #7d26cd;">)</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">num_read_28</span> : int32<span style="color: #7d26cd;">)</span>
  : <span style="color: #7d26cd;">(</span>contract_state &#215; bool<span style="color: #7d26cd;">)</span> :=
  <span style="color: #7d26cd;">(</span>
    <span style="color: #cd0000;">(</span>current_position_27<span style="color: #cd0000;">)</span> .+ <span style="color: #cd0000;">(</span>num_read_28<span style="color: #cd0000;">)</span>,
    <span style="color: #cd0000;">(</span>num_read_28<span style="color: #cd0000;">)</span> =.? <span style="color: #cd0000;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 1<span style="color: #cd0000;">)</span>
  <span style="color: #7d26cd;">)</span>.

</pre>
</div>
</div>
</li>

<li><a id="org47e5f62"></a>Contract state - Write Trait<br />
<div class="outline-text-5" id="text-1-6-4-2">
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">write_impl_for_contract_state_test</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">current_position_29</span> : contract_state<span style="color: #7d26cd;">)</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">len_30</span> : int32<span style="color: #7d26cd;">)</span>
  : bool :=
  option_is_none <span style="color: #7d26cd;">(</span>pub_uint32_checked_add <span style="color: #cd0000;">(</span>current_position_29<span style="color: #cd0000;">)</span> <span style="color: #cd0000;">(</span>len_30<span style="color: #cd0000;">)</span><span style="color: #7d26cd;">)</span>.

<span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">write_impl_for_contract_state</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">current_position_31</span> : contract_state<span style="color: #7d26cd;">)</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">num_bytes_32</span> : int32<span style="color: #7d26cd;">)</span>
  : <span style="color: #7d26cd;">(</span>contract_state &#215; uint_size<span style="color: #7d26cd;">)</span> :=
  <span style="color: #7d26cd;">(</span><span style="color: #cd0000;">(</span>current_position_31<span style="color: #cd0000;">)</span> .+ <span style="color: #cd0000;">(</span>num_bytes_32<span style="color: #cd0000;">)</span>, <span style="color: #87ceeb;">@</span>cast _ uint32 _ <span style="color: #cd0000;">(</span>num_bytes_32<span style="color: #cd0000;">)</span><span style="color: #7d26cd;">)</span>.

</pre>
</div>
</div>
</li>

<li><a id="org4f9b76e"></a>Contract State - Misc.<br />
<div class="outline-text-5" id="text-1-6-4-3">
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">has_contract_state_impl_for_contract_state_open</span>  : contract_state :=
  <span style="color: #87ceeb;">@</span>repr WORDSIZE32 0.

<span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">has_contract_state_impl_for_contract_state_reserve_0</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">len_33</span> : int32<span style="color: #7d26cd;">)</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">cur_size_34</span> : int32<span style="color: #7d26cd;">)</span>
  : bool :=
  <span style="color: #7d26cd;">(</span>cur_size_34<span style="color: #7d26cd;">)</span> &lt;.? <span style="color: #7d26cd;">(</span>len_33<span style="color: #7d26cd;">)</span>.

<span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">has_contract_state_impl_for_contract_state_reserve_1</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">res_35</span> : int32<span style="color: #7d26cd;">)</span>
  : bool :=
  <span style="color: #7d26cd;">(</span>res_35<span style="color: #7d26cd;">)</span> =.? <span style="color: #7d26cd;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE32 1<span style="color: #7d26cd;">)</span>.

<span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">has_contract_state_impl_for_contract_state_truncate_0</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">cur_size_36</span> : int32<span style="color: #7d26cd;">)</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">new_size_37</span> : int32<span style="color: #7d26cd;">)</span>
  : bool :=
  <span style="color: #7d26cd;">(</span>cur_size_36<span style="color: #7d26cd;">)</span> &gt;.? <span style="color: #7d26cd;">(</span>new_size_37<span style="color: #7d26cd;">)</span>.

<span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">has_contract_state_impl_for_contract_state_truncate_1</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">current_position_38</span> : contract_state<span style="color: #7d26cd;">)</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">new_size_39</span> : int32<span style="color: #7d26cd;">)</span>
  : contract_state :=
  <span style="color: #7d26cd;">(</span><span style="color: #00ff00;">if</span> <span style="color: #cd0000;">(</span><span style="color: #cd8500;">(</span>new_size_39<span style="color: #cd8500;">)</span> &lt;.? <span style="color: #cd8500;">(</span>current_position_38<span style="color: #cd8500;">)</span><span style="color: #cd0000;">)</span>:bool <span style="color: #00ff00;">then</span> <span style="color: #cd0000;">(</span>new_size_39<span style="color: #cd0000;">)</span> <span style="color: #00ff00;">else</span> <span style="color: #cd0000;">(</span>
      current_position_38<span style="color: #cd0000;">)</span><span style="color: #7d26cd;">)</span>.

</pre>
</div>
</div>
</li>
</ol>
</div>
