coq/src/concordium_impls.org
*** Parameter
#+NAME: linum18
#+CALL: next(ARG="0 4", linum=linum17) :exports none
#+NAME: seg18
#+CALL: split-file(ARG=linum18) :eval
#+RESULTS: seg18
#+begin_src coq :tangle ConcordiumImpls.v :results output silent
Notation "'parameter'" := (int32) : hacspec_scope.

Definition read_impl_for_parameter_read
  (current_position_40 : parameter)
  (num_read_41 : int32)
  : (parameter × uint_size) :=
  ((current_position_40) .+ (num_read_41), @cast _ uint32 _ (num_read_41)).

#+end_src

*** Attributes Cursor
#+NAME: linum19
#+CALL: next(ARG="0 -1", linum=linum18) :exports none
#+NAME: seg19
#+CALL: split-file(ARG=linum19) :eval
#+RESULTS: seg19
#+begin_src coq :tangle ConcordiumImpls.v :results output silent
Notation "'attributes_cursor'" := ((int32 × int16)) : hacspec_scope.

Definition has_policy_impl_for_policy_attributes_cursor_next_test
  (policy_attribute_items_42 : attributes_cursor)
  : bool :=
  let '(_, remaining_items_43) :=
    policy_attribute_items_42 in 
  (remaining_items_43) =.? (@repr WORDSIZE16 0).

Definition has_policy_impl_for_policy_attributes_cursor_next_tag_invalid
  (policy_attribute_items_44 : attributes_cursor)
  (tag_value_len_1_45 : int8)
  (num_read_46 : int32)
  : (attributes_cursor × bool) :=
  let '(current_position_47, remaining_items_48) :=
    policy_attribute_items_44 in 
  let policy_attribute_items_49 : (int32 × int16) :=
    ((current_position_47) .+ (num_read_46), remaining_items_48) in 
  (policy_attribute_items_49, (tag_value_len_1_45) >.? (@repr WORDSIZE8 31)).

Definition has_policy_impl_for_policy_attributes_cursor_next
  (policy_attribute_items_50 : attributes_cursor)
  (num_read_51 : int32)
  : attributes_cursor :=
  let '(current_position_52, remaining_items_53) :=
    policy_attribute_items_50 in 
  (
    (current_position_52) .+ (num_read_51),
    (remaining_items_53) .- (@repr WORDSIZE16 1)
  ).

#+end_src
