coq/src/concordium_impls.html

<div id="outline-container-org4a6120a" class="outline-4">
<h4 id="org4a6120a"><span class="section-number-4">1.6.5.</span> Parameter</h4>
<div class="outline-text-4" id="text-1-6-5">
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #b3b3b3;">Notation</span> <span style="color: #bdb76b;">"'parameter'"</span> := <span style="color: #7d26cd;">(</span>int32<span style="color: #7d26cd;">)</span> : hacspec_scope.

<span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">read_impl_for_parameter_read</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">current_position_40</span> : parameter<span style="color: #7d26cd;">)</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">num_read_41</span> : int32<span style="color: #7d26cd;">)</span>
  : <span style="color: #7d26cd;">(</span>parameter &#215; uint_size<span style="color: #7d26cd;">)</span> :=
  <span style="color: #7d26cd;">(</span><span style="color: #cd0000;">(</span>current_position_40<span style="color: #cd0000;">)</span> .+ <span style="color: #cd0000;">(</span>num_read_41<span style="color: #cd0000;">)</span>, <span style="color: #87ceeb;">@</span>cast _ uint32 _ <span style="color: #cd0000;">(</span>num_read_41<span style="color: #cd0000;">)</span><span style="color: #7d26cd;">)</span>.

</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd414e3" class="outline-4">
<h4 id="orgbd414e3"><span class="section-number-4">1.6.6.</span> Attributes Cursor</h4>
<div class="outline-text-4" id="text-1-6-6">
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #b3b3b3;">Notation</span> <span style="color: #bdb76b;">"'attributes_cursor'"</span> := <span style="color: #7d26cd;">(</span><span style="color: #cd0000;">(</span>int32 &#215; int16<span style="color: #cd0000;">)</span><span style="color: #7d26cd;">)</span> : hacspec_scope.

<span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">has_policy_impl_for_policy_attributes_cursor_next_test</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">policy_attribute_items_42</span> : attributes_cursor<span style="color: #7d26cd;">)</span>
  : bool :=
  <span style="color: #00ff00;">let</span> '<span style="color: #7d26cd;">(</span>_, remaining_items_43<span style="color: #7d26cd;">)</span> :=
    policy_attribute_items_42 <span style="color: #00ff00;">in</span> 
  <span style="color: #7d26cd;">(</span>remaining_items_43<span style="color: #7d26cd;">)</span> =.? <span style="color: #7d26cd;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE16 0<span style="color: #7d26cd;">)</span>.

<span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">has_policy_impl_for_policy_attributes_cursor_next_tag_invalid</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">policy_attribute_items_44</span> : attributes_cursor<span style="color: #7d26cd;">)</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">tag_value_len_1_45</span> : int8<span style="color: #7d26cd;">)</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">num_read_46</span> : int32<span style="color: #7d26cd;">)</span>
  : <span style="color: #7d26cd;">(</span>attributes_cursor &#215; bool<span style="color: #7d26cd;">)</span> :=
  <span style="color: #00ff00;">let</span> '<span style="color: #7d26cd;">(</span>current_position_47, remaining_items_48<span style="color: #7d26cd;">)</span> :=
    policy_attribute_items_44 <span style="color: #00ff00;">in</span> 
  <span style="color: #00ff00;">let</span> policy_attribute_items_49 : <span style="color: #7d26cd;">(</span>int32 &#215; int16<span style="color: #7d26cd;">)</span> :=
    <span style="color: #7d26cd;">(</span><span style="color: #cd0000;">(</span>current_position_47<span style="color: #cd0000;">)</span> .+ <span style="color: #cd0000;">(</span>num_read_46<span style="color: #cd0000;">)</span>, remaining_items_48<span style="color: #7d26cd;">)</span> <span style="color: #00ff00;">in</span> 
  <span style="color: #7d26cd;">(</span>policy_attribute_items_49, <span style="color: #cd0000;">(</span>tag_value_len_1_45<span style="color: #cd0000;">)</span> &gt;.? <span style="color: #cd0000;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE8 31<span style="color: #cd0000;">)</span><span style="color: #7d26cd;">)</span>.

<span style="color: #b3b3b3;">Definition</span> <span style="color: #00ffff;">has_policy_impl_for_policy_attributes_cursor_next</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">policy_attribute_items_50</span> : attributes_cursor<span style="color: #7d26cd;">)</span>
  <span style="color: #7d26cd;">(</span><span style="color: #9acd32;">num_read_51</span> : int32<span style="color: #7d26cd;">)</span>
  : attributes_cursor :=
  <span style="color: #00ff00;">let</span> '<span style="color: #7d26cd;">(</span>current_position_52, remaining_items_53<span style="color: #7d26cd;">)</span> :=
    policy_attribute_items_50 <span style="color: #00ff00;">in</span> 
  <span style="color: #7d26cd;">(</span>
    <span style="color: #cd0000;">(</span>current_position_52<span style="color: #cd0000;">)</span> .+ <span style="color: #cd0000;">(</span>num_read_51<span style="color: #cd0000;">)</span>,
    <span style="color: #cd0000;">(</span>remaining_items_53<span style="color: #cd0000;">)</span> .- <span style="color: #cd0000;">(</span><span style="color: #87ceeb;">@</span>repr WORDSIZE16 1<span style="color: #cd0000;">)</span>
  <span style="color: #7d26cd;">)</span>.

</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lasse Letager Hansen</p>
<p class="date">Created: 2022-01-06 Thu 12:23</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
